-------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/miguelportela/Documents/GitHub/Stata_Training/3.Panel_Data/panel_
> simulation/logs/panel_simulation_full.txt
  log type:  text
 opened on:  28 Dec 2021, 20:17:30
r; t=0.00 20:17:30

. 
. global st = "$S_TIME"
r; t=0.00 20:17:30

. 
. mat def mat_seed = .
r; t=0.00 20:17:30

. mat def mat_size = .
r; t=0.00 20:17:30

. mat def mat_beta_educ = .
r; t=0.00 20:17:30

. 
. // 1st seed
. set seed 444555666      // specify initial value of random-number seed
r; t=0.00 20:17:30

. 
. // start here
. 
. // sample size
. local nnn = "1000 2500"         // we will work with two sample sizes
r; t=0.00 20:17:30

. tokenize `nnn'
r; t=0.00 20:17:30

. 
. foreach nobs of local nnn {
  2. 
. // number of simulations for each sample size
. foreach v of numlist 1/25 {
  3. 
. clear
  4. 
. // renew 'seed'
. 
.                 set obs 1
  5.                 gen a = int(uniform()*1000000000)
  6.                 format %16.0f a
  7.                 l a
  8.                 sum a
  9.                 ret li
 10.                         local seed2 = r(mean)
 11. 
.                         di _new _new "/////////////////////////////////////////////
> ////////////////////////////////" _new
 12.                         display _new _new _new "PARAMETERS:     SIZE: `nobs' SEE
> D: `seed2'" _new _new
 13.                         di _new "///////////////////////////////////////////////
> //////////////////////////////" _new
 14. 
. // generate the variables relevant for the estimations
. 
. set obs `nobs'          // set the number of observation in the sample
 15. gen idtrab = int(_n/10.1)+1
 16. 
. bysort idtrab: gen year = _n
 17. sort idtrab year
 18. tsset idtrab year
 19. 
. set seed `seed2'
 20. bysort idtrab (year): gen double ui = runiform() if _n == 1
 21.      bysort idtrab (year): replace ui = ui[_n-1] if _n > 1
 22. 
. // build the instrument
. 
. bysort idtrab (year): gen quarter= int(4*uniform()+1) if _n == 1
 23.      bysort idtrab (year): replace quarter = quarter[_n-1] if _n > 1
 24. 
.         gen q1=(quarter==1)
 25.          
. bysort idtrab (year): gen educ= int(25*uniform())*ui if _n == 1         // define e
> ducation as a function of the specific effect
 26.         bysort idtrab (year): replace educ= educ - 3*q1 if _n == 1              
> // define education as a function of the instrument
 27. 
.         bysort idtrab (year): replace educ = educ[_n-1] + round(uniform()) if _n > 
> 1            // increase education over time following a random distribution
 28.                 sum educ, detail
 29.         
. bysort idtrab (year): gen exper= int(20*uniform()) if _n == 1           // define e
> xperience fo each worker
 30.         bysort idtrab (year): replace exper = exper[_n-1] + 1 if _n > 1
 31. 
.         gen exper2 = exper^2
 32. 
. // minimum wage = 485 euro
. gen double lnwage = ln(485) + 0.06*educ + 0.007*exper - 0.00001*exper2 + 0.02*year 
> + ui + uniform()/ln(485)
 33. 
. // this is the regression we want to estimate
. 
. xi: ivreg2 lnwage (educ = q1) exper exper2 year, first
 34.         
.         mat mat_size = mat_size\(`nobs')
 35.         mat mat_seed = mat_seed\(`seed2')
 36.         mat mat_beta_educ = mat_beta_educ\_b[educ]
 37.         
. }
 38. }
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 643335296 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.43e+08           .   6.43e+08   6.43e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  643335296
                r(Var) =  .
                 r(sd) =  .
                r(min) =  643335296
                r(max) =  643335296
                r(sum) =  643335296


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 643335296



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(20 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -2             -3
 5%     .3155823             -3
10%     1.142079      -2.245361       Obs               1,000
25%     3.049344      -2.135584       Sum of wgt.       1,000

50%     6.273581                      Mean           7.634524
                        Largest       Std. dev.      5.865423
75%     11.23538       25.88244
90%     16.56564       26.24304       Variance       34.40319
95%     19.09756       27.24304       Skewness       .7538182
99%     23.06274       27.24304       Kurtosis       2.955646
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.179418   .4528728    -7.02   0.000    -4.068113   -2.290722
       exper |   .1844307   .1157473     1.59   0.111     -.042706    .4115674
      exper2 |  -.0103782   .0039555    -2.62   0.009    -.0181402   -.0026162
        year |   .6124122   .0678799     9.02   0.000      .479208    .7456164
       _cons |   4.716774   .7738033     6.10   0.000       3.1983    6.235248
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    49.29
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    49.29
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      49.29    0.0000 |       49.54   0.0000 |       49.29

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=47.20    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      49.29

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       4.70     P-val=0.0303
Anderson-Rubin Wald test           Chi-sq(1)=      4.73     P-val=0.0297
Stock-Wright LM S statistic        Chi-sq(1)=      4.70     P-val=0.0301

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    52.95
                                                      Prob > F      =   0.0000
Total (centered) SS     =  349.7881994                Centered R2   =   0.5339
Total (uncentered) SS   =  55131.45171                Uncentered R2 =   0.9970
Residual SS             =  163.0219974                Root MSE      =    .4038

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0316076    .010457     3.02   0.003     .0111123    .0521029
       exper |    .025521   .0091353     2.79   0.005     .0076161    .0434258
      exper2 |  -.0009788   .0003273    -2.99   0.003    -.0016203   -.0003372
        year |    .043119   .0076578     5.63   0.000       .02811    .0581281
       _cons |   6.795617   .0618759   109.83   0.000     6.674343    6.916892
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          47.198
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               49.288
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 480354208 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    4.80e+08           .   4.80e+08   4.80e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  480354208
                r(Var) =  .
                 r(sd) =  .
                r(min) =  480354208
                r(max) =  480354208
                r(sum) =  480354208


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 480354208



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(23 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.819992             -3
 5%     .1509251             -3
10%     1.097353      -2.819992       Obs               1,000
25%     2.712828      -2.819992       Sum of wgt.       1,000

50%     5.479608                      Mean           6.780453
                        Largest       Std. dev.      5.370532
75%     10.00258       22.70677
90%     14.99772       22.90472       Variance       28.84262
95%      17.1326       22.90472       Skewness       .8122067
99%     21.70677       23.70677       Kurtosis       3.155905
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -.5510557   .3900959    -1.41   0.158    -1.316561    .2144493
       exper |  -.0648401   .1054547    -0.61   0.539    -.2717793    .1420991
      exper2 |   .0008802   .0036267     0.24   0.808    -.0062367     .007997
        year |   .5060986    .063292     8.00   0.000     .3818975    .6302997
       _cons |   4.789143   .6930178     6.91   0.000     3.429199    6.149087
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =     2.00
  Prob > F      =   0.1581
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =     2.00
  Prob > F      =   0.1581



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |       2.00    0.1581 |        2.01   0.1567 |        2.00

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=2.00     P-val=0.1571

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                       2.00

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       1.37     P-val=0.2422
Anderson-Rubin Wald test           Chi-sq(1)=      1.38     P-val=0.2407
Stock-Wright LM S statistic        Chi-sq(1)=      1.37     P-val=0.2411

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =     6.88
                                                      Prob > F      =   0.0000
Total (centered) SS     =  329.3610762                Centered R2   =  -1.9354
Total (uncentered) SS   =  54147.42741                Uncentered R2 =   0.9821
Residual SS             =  966.8190596                Root MSE      =    .9833

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |  -.0879118   .1339425    -0.66   0.512    -.3504343    .1746108
       exper |   .0088231   .0222405     0.40   0.692    -.0347676    .0524138
      exper2 |  -.0002855   .0007035    -0.41   0.685    -.0016644    .0010934
        year |   .0946829   .0688625     1.37   0.169    -.0402851    .2296508
       _cons |   7.351721   .6443121    11.41   0.000     6.088892    8.614549
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           2.001
                                                   Chi-sq(1) P-val =    0.1571
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                1.995
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 655165760 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.55e+08           .   6.55e+08   6.55e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  655165760
                r(Var) =  .
                 r(sd) =  .
                r(min) =  655165760
                r(max) =  655165760
                r(sum) =  655165760


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 655165760



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(20 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.508853      -2.997093
 5%     .8732502      -2.610443
10%     1.994128      -2.610443       Obs               1,000
25%     4.215283      -2.224173       Sum of wgt.       1,000

50%     7.540476                      Mean           8.413144
                        Largest       Std. dev.      5.521386
75%     11.84006        24.0995
90%     16.49055       24.15807       Variance        30.4857
95%     18.81886       24.15807       Skewness       .5633347
99%     22.68841       24.27732       Kurtosis       2.745025
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.474953   .4141565    -5.98   0.000    -3.287673   -1.662233
       exper |   -.085522   .1062886    -0.80   0.421    -.2940976    .1230537
      exper2 |   .0025418   .0035535     0.72   0.475    -.0044314    .0095151
        year |   .5255447   .0632906     8.30   0.000     .4013464    .6497431
       _cons |   6.586985   .7214351     9.13   0.000     5.171276    8.002693
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    35.71
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    35.71
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      35.71    0.0000 |       35.89   0.0000 |       35.71

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=34.65    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      35.71

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      29.08     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     29.22     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     28.39     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =   240.28
                                                      Prob > F      =   0.0000
Total (centered) SS     =  306.6708312                Centered R2   =   0.8755
Total (uncentered) SS   =  56138.03923                Uncentered R2 =   0.9993
Residual SS             =  38.18251205                Root MSE      =    .1954

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0898817    .006255    14.37   0.000     .0776222    .1021412
       exper |   .0189765    .004054     4.68   0.000     .0110307    .0269223
      exper2 |  -.0005878    .000135    -4.36   0.000    -.0008524   -.0003233
        year |   .0101738   .0040939     2.49   0.013     .0021498    .0181977
       _cons |   6.534385   .0483355   135.19   0.000     6.439649     6.62912
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          34.647
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               35.711
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 683240192 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.83e+08           .   6.83e+08   6.83e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  683240192
                r(Var) =  .
                 r(sd) =  .
                r(min) =  683240192
                r(max) =  683240192
                r(sum) =  683240192


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 683240192



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(23 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.860668             -3
 5%     .1078446             -3
10%     1.075216             -3       Obs               1,000
25%     3.409593             -3       Sum of wgt.       1,000

50%     7.511896                      Mean           8.359941
                        Largest       Std. dev.      6.127706
75%     12.81147       26.59697
90%     16.58779       26.98663       Variance       37.54878
95%     19.19268       27.59697       Skewness       .4811032
99%     23.79615       27.98663       Kurtosis       2.630672
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.256293   .4449535    -5.07   0.000    -3.129448   -1.383138
       exper |   .1044158   .1282695     0.81   0.416    -.1472941    .3561256
      exper2 |  -.0049851   .0043684    -1.14   0.254    -.0135574    .0035873
        year |   .5261598   .0730575     7.20   0.000     .3827952    .6695243
       _cons |   5.660316   .8406193     6.73   0.000     4.010726    7.309906
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    25.71
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    25.71
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      25.71    0.0000 |       25.84   0.0000 |       25.71

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=25.19    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      25.71

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       0.06     P-val=0.8121
Anderson-Rubin Wald test           Chi-sq(1)=      0.06     P-val=0.8116
Stock-Wright LM S statistic        Chi-sq(1)=      0.06     P-val=0.8116

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    20.14
                                                      Prob > F      =   0.0000
Total (centered) SS     =    384.09093                Centered R2   =   0.1488
Total (uncentered) SS   =  55951.56294                Uncentered R2 =   0.9942
Residual SS             =  326.9348306                Root MSE      =    .5718

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0047778   .0191666     0.25   0.803    -.0327879    .0423436
       exper |   .0226162   .0124647     1.81   0.070    -.0018141    .0470465
      exper2 |  -.0007281   .0004303    -1.69   0.091    -.0015714    .0001152
        year |    .049784   .0126823     3.93   0.000     .0249272    .0746408
       _cons |   6.993084   .1329552    52.60   0.000     6.732497    7.253672
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          25.192
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               25.714
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 827602048 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    8.28e+08           .   8.28e+08   8.28e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  827602048
                r(Var) =  .
                 r(sd) =  .
                r(min) =  827602048
                r(max) =  827602048
                r(sum) =  827602048


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 827602048



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(22 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.455455             -3
 5%            0      -2.455455
10%     .9101009             -2       Obs               1,000
25%      2.70088      -1.802789       Sum of wgt.       1,000

50%     5.140886                      Mean           6.549136
                        Largest       Std. dev.      5.408991
75%     9.513639       25.22182
90%     13.40578       25.22182       Variance       29.25718
95%     18.65583       26.22182       Skewness       1.156433
99%      23.3234       27.22182       Kurtosis       4.230272
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.545848   .3980759    -6.40   0.000    -3.327013   -1.764683
       exper |    .054089     .10151     0.53   0.594    -.1451092    .2532873
      exper2 |  -.0053845   .0035181    -1.53   0.126    -.0122883    .0015193
        year |   .5935669   .0612728     9.69   0.000     .4733282    .7138056
       _cons |    4.29076    .640435     6.70   0.000     3.034002    5.547518
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    40.90
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    40.90
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      40.90    0.0000 |       41.11   0.0000 |       40.90

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=39.48    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      40.90

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       4.02     P-val=0.0453
Anderson-Rubin Wald test           Chi-sq(1)=      4.04     P-val=0.0445
Stock-Wright LM S statistic        Chi-sq(1)=      4.02     P-val=0.0450

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    47.78
                                                      Prob > F      =   0.0000
Total (centered) SS     =  293.7999695                Centered R2   =   0.5061
Total (uncentered) SS   =  54078.13114                Uncentered R2 =   0.9973
Residual SS             =  145.1187949                Root MSE      =    .3809

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0319515    .011749     2.72   0.007     .0089239     .054979
       exper |    .003909   .0075331     0.52   0.604    -.0108557    .0186737
      exper2 |  -.0001401   .0002613    -0.54   0.592    -.0006523    .0003721
        year |   .0395138   .0085429     4.63   0.000       .02277    .0562576
       _cons |   6.884354   .0709605    97.02   0.000     6.745274    7.023434
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          39.483
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               40.901
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 517011488 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    5.17e+08           .   5.17e+08   5.17e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  517011488
                r(Var) =  .
                 r(sd) =  .
                r(min) =  517011488
                r(max) =  517011488
                r(sum) =  517011488


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 517011488



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(17 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.426037      -2.691439
 5%     .4148797      -1.924222
10%     1.297953      -1.924222       Obs               1,000
25%     3.271177       -1.72823       Sum of wgt.       1,000

50%     6.637812                      Mean           7.604569
                        Largest       Std. dev.      5.636593
75%     10.51444       26.40488
90%     15.88182       26.40488       Variance       31.77118
95%      18.9523       26.40488       Skewness       .8767294
99%        23.77       27.40488       Kurtosis       3.450037
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |   -3.33752   .4492767    -7.43   0.000    -4.219158   -2.455881
       exper |  -.0657335   .1083664    -0.61   0.544    -.2783864    .1469195
      exper2 |   .0009418   .0036583     0.26   0.797    -.0062371    .0081207
        year |   .5352385   .0656298     8.16   0.000     .4064499    .6640272
       _cons |   5.963131   .7918337     7.53   0.000     4.409276    7.516987
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    55.18
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    55.18
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      55.18    0.0000 |       55.46   0.0000 |       55.18

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=52.55    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      55.18

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      43.53     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     43.75     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     41.91     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =   195.06
                                                      Prob > F      =   0.0000
Total (centered) SS     =  342.1452648                Centered R2   =   0.8500
Total (uncentered) SS   =   55433.1394                Uncentered R2 =   0.9991
Residual SS             =  51.33148314                Root MSE      =    .2266

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0922195   .0057493    16.04   0.000     .0809511     .103488
       exper |  -.0001032   .0046759    -0.02   0.982    -.0092677    .0090614
      exper2 |  -.0000207   .0001569    -0.13   0.895    -.0003282    .0002868
        year |   .0104095   .0041005     2.54   0.011     .0023728    .0184463
       _cons |   6.670911   .0473551   140.87   0.000     6.578096    6.763725
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          52.548
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               55.185
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 617198848 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.17e+08           .   6.17e+08   6.17e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  617198848
                r(Var) =  .
                 r(sd) =  .
                r(min) =  617198848
                r(max) =  617198848
                r(sum) =  617198848


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 617198848



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(30 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.416206             -3
 5%     .2105874             -3
10%     1.168872             -3       Obs               1,000
25%     3.590922      -2.547507       Sum of wgt.       1,000

50%     6.842857                      Mean           8.047903
                        Largest       Std. dev.      6.016487
75%     11.81048       24.52634
90%     17.48406       24.52634       Variance       36.19811
95%     19.53136       25.52634       Skewness       .6644766
99%     23.52634       26.52634       Kurtosis       2.753351
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -1.034014   .3930894    -2.63   0.009    -1.805393   -.2626349
       exper |  -.1269205   .1276796    -0.99   0.320    -.3774727    .1236318
      exper2 |   .0106449   .0042417     2.51   0.012     .0023212    .0189687
        year |   .3484933      .0709     4.92   0.000     .2093627     .487624
       _cons |   5.553471   .9120363     6.09   0.000     3.763736    7.343207
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =     6.92
  Prob > F      =   0.0087
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =     6.92
  Prob > F      =   0.0087



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |       6.92    0.0087 |        6.95   0.0084 |        6.92

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=6.91     P-val=0.0086

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                       6.92

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       0.40     P-val=0.5287
Anderson-Rubin Wald test           Chi-sq(1)=      0.40     P-val=0.5275
Stock-Wright LM S statistic        Chi-sq(1)=      0.40     P-val=0.5276

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    19.88
                                                      Prob > F      =   0.0000
Total (centered) SS     =  372.5180039                Centered R2   =  -0.3387
Total (uncentered) SS   =   56125.6375                Uncentered R2 =   0.9911
Residual SS             =  498.6771477                Root MSE      =    .7062

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |  -.0243216   .0471326    -0.52   0.606    -.1166997    .0680565
       exper |  -.0049043   .0168101    -0.29   0.770    -.0378514    .0280429
      exper2 |   .0009367   .0007159     1.31   0.191    -.0004663    .0023398
        year |   .0485392    .018811     2.58   0.010     .0116702    .0854081
       _cons |   7.223344   .2696209    26.79   0.000     6.694896    7.751791
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           6.906
                                                   Chi-sq(1) P-val =    0.0086
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                6.919
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 489450848 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    4.89e+08           .   4.89e+08   4.89e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  489450848
                r(Var) =  .
                 r(sd) =  .
                r(min) =  489450848
                r(max) =  489450848
                r(sum) =  489450848


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 489450848



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(28 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.104024             -3
 5%     .0359565             -3
10%     1.434908      -2.761076       Obs               1,000
25%       3.8343      -2.741308       Sum of wgt.       1,000

50%     7.466235                      Mean            8.12108
                        Largest       Std. dev.      5.521085
75%     12.32234        24.1321
90%     15.35527        24.1321       Variance       30.48238
95%     17.79104        24.1321       Skewness       .4011105
99%      22.4596        24.1321       Kurtosis       2.652694
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.696474   .3737043    -7.22   0.000    -3.429813   -1.963135
       exper |   .0550373   .1071337     0.51   0.608    -.1551967    .2652713
      exper2 |   .0002129   .0036922     0.06   0.954    -.0070325    .0074582
        year |   .4516077   .0635699     7.10   0.000     .3268611    .5763542
       _cons |   5.510806   .7295559     7.55   0.000     4.079161     6.94245
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    52.06
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    52.06
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      52.06    0.0000 |       52.33   0.0000 |       52.06

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=49.72    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      52.06

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       4.20     P-val=0.0407
Anderson-Rubin Wald test           Chi-sq(1)=      4.22     P-val=0.0400
Stock-Wright LM S statistic        Chi-sq(1)=      4.20     P-val=0.0404

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    48.14
                                                      Prob > F      =   0.0000
Total (centered) SS     =  324.6762258                Centered R2   =   0.4986
Total (uncentered) SS   =  56231.74278                Uncentered R2 =   0.9971
Residual SS             =  162.7947568                Root MSE      =    .4035

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0297144   .0107788     2.76   0.006     .0085882    .0508405
       exper |  -.0131057   .0083094    -1.58   0.115    -.0293919    .0031805
      exper2 |    .000684   .0002872     2.38   0.017      .000121     .001247
        year |   .0356768   .0072109     4.95   0.000     .0215437    .0498098
       _cons |   7.058129   .0796114    88.66   0.000     6.902093    7.214164
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          49.724
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               52.064
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 432312768 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    4.32e+08           .   4.32e+08   4.32e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  432312768
                r(Var) =  .
                 r(sd) =  .
                r(min) =  432312768
                r(max) =  432312768
                r(sum) =  432312768


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 432312768



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(25 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.577893             -3
 5%            0             -3
10%     1.114887      -2.530451       Obs               1,000
25%     3.538993      -2.530451       Sum of wgt.       1,000

50%     7.073992                      Mean           8.115807
                        Largest       Std. dev.      5.941169
75%     12.01366       26.00213
90%     16.59035       26.00213       Variance       35.29748
95%     19.34564       26.00213       Skewness       .6894463
99%     24.84851       26.69489       Kurtosis       3.028237
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.647166    .408504    -8.93   0.000    -4.448794   -2.845538
       exper |    -.33301   .1160187    -2.87   0.004    -.5606795   -.1053405
      exper2 |   .0095291   .0040269     2.37   0.018     .0016269    .0174313
        year |   .5747099    .067611     8.50   0.000     .4420333    .7073865
       _cons |   8.231784    .786707    10.46   0.000     6.687988    9.775579
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    79.71
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    79.71
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      79.71    0.0000 |       80.11   0.0000 |       79.71

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=74.17    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      79.71

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      18.49     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     18.58     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     18.24     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    80.20
                                                      Prob > F      =   0.0000
Total (centered) SS     =  354.4464303                Centered R2   =   0.6947
Total (uncentered) SS   =  56096.08185                Uncentered R2 =   0.9981
Residual SS             =  108.2028187                Root MSE      =    .3289

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |    .049377   .0066659     7.41   0.000     .0363122    .0624418
       exper |   .0016552   .0071359     0.23   0.817    -.0123309    .0156414
      exper2 |   .0002046   .0002454     0.83   0.404    -.0002763    .0006855
        year |   .0244585   .0054966     4.45   0.000     .0136855    .0352316
       _cons |   6.858118   .0654373   104.80   0.000     6.729863    6.986373
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          74.170
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               79.711
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 825321344 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    8.25e+08           .   8.25e+08   8.25e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  825321344
                r(Var) =  .
                 r(sd) =  .
                r(min) =  825321344
                r(max) =  825321344
                r(sum) =  825321344


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 825321344



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(27 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.048771      -2.934167
 5%    -.5993657      -2.699722
10%     1.112742      -2.699722       Obs               1,000
25%     3.765437      -2.699722       Sum of wgt.       1,000

50%     6.972953                      Mean           8.386642
                        Largest       Std. dev.      6.301193
75%     12.79256       27.02633
90%     17.20091       27.02633       Variance       39.70503
95%     20.53046       27.02633       Skewness       .6305059
99%     25.19753       28.02633       Kurtosis       2.850179
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.223739   .4297071    -7.50   0.000    -4.066975   -2.380503
       exper |   .0075266   .1339796     0.06   0.955    -.2553883    .2704416
      exper2 |  -.0021307   .0044539    -0.48   0.632    -.0108708    .0066094
        year |   .5399191   .0737527     7.32   0.000     .3951905    .6846477
       _cons |   6.721136   .9756964     6.89   0.000     4.806477    8.635795
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    56.28
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    56.28
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      56.28    0.0000 |       56.57   0.0000 |       56.28

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=53.54    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      56.28

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      18.86     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     18.96     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     18.60     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    84.06
                                                      Prob > F      =   0.0000
Total (centered) SS     =  405.0925237                Centered R2   =   0.7501
Total (uncentered) SS   =  56653.60263                Uncentered R2 =   0.9982
Residual SS             =  101.2257392                Root MSE      =    .3182

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0590998   .0070914     8.33   0.000     .0452009    .0729987
       exper |     .00419   .0071292     0.59   0.557    -.0097829    .0181629
      exper2 |  -.0000365   .0002377    -0.15   0.878    -.0005023    .0004294
        year |   .0249753   .0054709     4.57   0.000     .0142525    .0356981
       _cons |   6.810972   .0654394   104.08   0.000     6.682713    6.939231
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          53.537
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               56.283
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +----------+
     |        a |
     |----------|
  1. | 24617752 |
     +----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.46e+07           .   2.46e+07   2.46e+07

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  24617752
                r(Var) =  .
                 r(sd) =  .
                r(min) =  24617752
                r(max) =  24617752
                r(sum) =  24617752


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 24617752



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(23 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.277765             -3
 5%            0             -3
10%     1.006827             -3       Obs               1,000
25%            3             -3       Sum of wgt.       1,000

50%     6.043963                      Mean           7.641803
                        Largest       Std. dev.      6.297652
75%     11.78015       26.82059
90%     17.23138       26.82059       Variance       39.66042
95%     19.69585       27.08777       Skewness        .801123
99%     24.65522       27.08777       Kurtosis       2.943454
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -1.056318   .4666616    -2.26   0.024    -1.972072   -.1405645
       exper |   .0236102   .1238353     0.19   0.849    -.2193982    .2666186
      exper2 |   .0007957   .0041944     0.19   0.850    -.0074352    .0090265
        year |   .4490573    .074044     6.06   0.000      .303757    .5943576
       _cons |   4.851061   .8496973     5.71   0.000     3.183657    6.518466
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =     5.12
  Prob > F      =   0.0238
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =     5.12
  Prob > F      =   0.0238



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |       5.12    0.0238 |        5.15   0.0233 |        5.12

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=5.12     P-val=0.0236

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                       5.12

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       2.32     P-val=0.1284
Anderson-Rubin Wald test           Chi-sq(1)=      2.33     P-val=0.1272
Stock-Wright LM S statistic        Chi-sq(1)=      2.32     P-val=0.1276

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =     7.62
                                                      Prob > F      =   0.0000
Total (centered) SS     =   417.117242                Centered R2   =  -1.5031
Total (uncentered) SS   =  55476.80332                Uncentered R2 =   0.9812
Residual SS             =   1044.08413                Root MSE      =    1.022

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |  -.0683423   .0737701    -0.93   0.354     -.212929    .0762444
       exper |   .0144346    .020747     0.70   0.487    -.0262287     .055098
      exper2 |   .0000483    .000704     0.07   0.945    -.0013316    .0014282
        year |   .0735695   .0351128     2.10   0.036     .0047496    .1423894
       _cons |   7.315894   .3672959    19.92   0.000     6.596008    8.035781
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           5.123
                                                   Chi-sq(1) P-val =    0.0236
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                5.124
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 977220032 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    9.77e+08           .   9.77e+08   9.77e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  977220032
                r(Var) =  .
                 r(sd) =  .
                r(min) =  977220032
                r(max) =  977220032
                r(sum) =  977220032


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 977220032



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(23 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.870226             -3
 5%            0      -2.953124
10%            1      -2.953124       Obs               1,000
25%     2.902257      -2.610539       Sum of wgt.       1,000

50%     6.162021                      Mean           7.410114
                        Largest       Std. dev.      5.968608
75%     11.20203       27.63596
90%     15.93133       27.63596       Variance       35.62428
95%     18.69789       28.01845       Skewness       .8667502
99%      25.8272       28.01845       Kurtosis       3.464475
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -1.833033   .4364978    -4.20   0.000    -2.689595   -.9764707
       exper |   .0196969   .1291231     0.15   0.879     -.233688    .2730819
      exper2 |   .0026088   .0044313     0.59   0.556     -.006087    .0113045
        year |   .3910151   .0720979     5.42   0.000     .2495338    .5324965
       _cons |   4.756971   .8962377     5.31   0.000     2.998238    6.515704
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    17.64
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    17.64
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      17.64    0.0000 |       17.72   0.0000 |       17.64

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=17.41    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      17.64

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       7.45     P-val=0.0065
Anderson-Rubin Wald test           Chi-sq(1)=      7.48     P-val=0.0062
Stock-Wright LM S statistic        Chi-sq(1)=      7.43     P-val=0.0064

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =   160.65
                                                      Prob > F      =   0.0000
Total (centered) SS     =  354.9121396                Centered R2   =   0.8015
Total (uncentered) SS   =  55248.41445                Uncentered R2 =   0.9987
Residual SS             =  70.44102713                Root MSE      =    .2654

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0632917   .0110385     5.73   0.000     .0416566    .0849268
       exper |   .0131924   .0059924     2.20   0.028     .0014476    .0249373
      exper2 |   .0001389   .0002085     0.67   0.505    -.0002698    .0005476
        year |   .0085583   .0052068     1.64   0.100    -.0016469    .0187634
       _cons |   6.669828    .062046   107.50   0.000      6.54822    6.791436
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          17.415
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               17.635
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 948834944 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    9.49e+08           .   9.49e+08   9.49e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  948834944
                r(Var) =  .
                 r(sd) =  .
                r(min) =  948834944
                r(max) =  948834944
                r(sum) =  948834944


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 948834944



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(18 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.997662             -3
 5%     .1922235      -2.997662
10%     1.316475      -2.997662       Obs               1,000
25%     3.468783      -2.787966       Sum of wgt.       1,000

50%     6.643789                      Mean           7.670424
                        Largest       Std. dev.      5.787206
75%     10.53199       25.83175
90%      15.3761       25.95206       Variance       33.49175
95%     20.83175       25.95206       Skewness       .9595755
99%     24.58171       26.95206       Kurtosis        3.81539
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -4.352271   .4481114    -9.71   0.000    -5.231623   -3.472919
       exper |  -.1485107   .1157214    -1.28   0.200    -.3755968    .0785754
      exper2 |   .0025281   .0040117     0.63   0.529    -.0053442    .0104005
        year |   .5790877   .0658228     8.80   0.000     .4499202    .7082552
       _cons |   6.691545   .7430152     9.01   0.000     5.233488    8.149601
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    94.33
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    94.33
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      94.33    0.0000 |       94.81   0.0000 |       94.33

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=86.60    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      94.33

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      32.96     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     33.13     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     32.07     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =   122.13
                                                      Prob > F      =   0.0000
Total (centered) SS     =  338.5659305                Centered R2   =   0.7668
Total (uncentered) SS   =  55185.22577                Uncentered R2 =   0.9986
Residual SS             =  78.95965718                Root MSE      =     .281

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0606734   .0054099    11.22   0.000     .0500702    .0712767
       exper |  -.0095518   .0062253    -1.53   0.125    -.0217532    .0026496
      exper2 |   .0003822   .0002133     1.79   0.073     -.000036    .0008003
        year |   .0256549   .0045531     5.63   0.000     .0167309    .0345788
       _cons |   6.842714   .0525597   130.19   0.000     6.739699    6.945729
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          86.596
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               94.332
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 687291392 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.87e+08           .   6.87e+08   6.87e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  687291392
                r(Var) =  .
                 r(sd) =  .
                r(min) =  687291392
                r(max) =  687291392
                r(sum) =  687291392


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 687291392



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(25 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1.65047             -3
 5%      .569334             -3
10%      1.34953             -3       Obs               1,000
25%     3.249349       -2.65047       Sum of wgt.       1,000

50%      6.12339                      Mean           7.935636
                        Largest       Std. dev.      6.130346
75%      12.1733       26.70801
90%     17.17249       27.49081       Variance       37.58114
95%     19.13493       27.49081       Skewness       .7775111
99%     24.70801       27.70801       Kurtosis       2.821757
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.219362   .4303789    -5.16   0.000    -3.063916   -1.374807
       exper |   .2192072   .1414385     1.55   0.121    -.0583448    .4967592
      exper2 |  -.0069086   .0048448    -1.43   0.154    -.0164157    .0025986
        year |   .4590156   .0756129     6.07   0.000     .3106365    .6073948
       _cons |   4.442184   .9975181     4.45   0.000     2.484704    6.399665
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    26.59
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    26.59
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      26.59    0.0000 |       26.73   0.0000 |       26.59

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=26.03    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      26.59

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       8.54     P-val=0.0035
Anderson-Rubin Wald test           Chi-sq(1)=      8.59     P-val=0.0034
Stock-Wright LM S statistic        Chi-sq(1)=      8.51     P-val=0.0035

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    89.97
                                                      Prob > F      =   0.0000
Total (centered) SS     =  378.9188363                Centered R2   =   0.7637
Total (uncentered) SS   =   56043.2292                Uncentered R2 =   0.9984
Residual SS             =  89.52982229                Root MSE      =    .2992

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |    .056672   .0098311     5.76   0.000     .0374034    .0759406
       exper |   .0202606   .0073968     2.74   0.006     .0057631    .0347581
      exper2 |  -.0003831   .0002524    -1.52   0.129    -.0008779    .0001116
        year |   .0195826   .0059569     3.29   0.001     .0079074    .0312579
       _cons |   6.699318   .0645602   103.77   0.000     6.572783    6.825854
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          26.030
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               26.592
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 290429760 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.90e+08           .   2.90e+08   2.90e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  290429760
                r(Var) =  .
                 r(sd) =  .
                r(min) =  290429760
                r(max) =  290429760
                r(sum) =  290429760


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 290429760



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(22 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%     -1.48125      -2.863325
 5%     .5633492      -2.487302
10%     1.497894       -2.48125       Obs               1,000
25%      3.19061      -1.863325       Sum of wgt.       1,000

50%     5.919006                      Mean           7.363453
                        Largest       Std. dev.      5.675785
75%     10.34234       24.78753
90%     16.38787       24.78753       Variance       32.21454
95%     18.65889       25.78753       Skewness       .9323631
99%     22.71597       26.78753       Kurtosis       3.208119
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -.8154136    .416217    -1.96   0.050    -1.632177    .0013502
       exper |  -.1524893   .1112254    -1.37   0.171    -.3707527     .065774
      exper2 |   .0027905   .0038511     0.72   0.469    -.0047667    .0103477
        year |   .5929535   .0663939     8.93   0.000     .4626654    .7232416
       _cons |   5.746664   .7509908     7.65   0.000     4.272956    7.220371
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =     3.84
  Prob > F      =   0.0504
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =     3.84
  Prob > F      =   0.0504



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |       3.84    0.0504 |        3.86   0.0495 |        3.84

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=3.84     P-val=0.0500

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                       3.84

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       2.26     P-val=0.1328
Anderson-Rubin Wald test           Chi-sq(1)=      2.27     P-val=0.1316
Stock-Wright LM S statistic        Chi-sq(1)=      2.27     P-val=0.1320

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =     7.44
                                                      Prob > F      =   0.0000
Total (centered) SS     =   359.865531                Centered R2   =  -1.7627
Total (uncentered) SS   =  54909.91679                Uncentered R2 =   0.9819
Residual SS             =  994.2072857                Root MSE      =    .9971

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |  -.0811464   .0933831    -0.87   0.385    -.2641739    .1018812
       exper |  -.0209774   .0252632    -0.83   0.406    -.0704924    .0285376
      exper2 |   .0005582   .0007565     0.74   0.461    -.0009245    .0020409
        year |   .1056302   .0570334     1.85   0.064    -.0061532    .2174136
       _cons |   7.559818   .5423501    13.94   0.000     6.496832    8.622805
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           3.843
                                                   Chi-sq(1) P-val =    0.0500
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                3.838
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 385178592 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    3.85e+08           .   3.85e+08   3.85e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  385178592
                r(Var) =  .
                 r(sd) =  .
                r(min) =  385178592
                r(max) =  385178592
                r(sum) =  385178592


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 385178592



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(24 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.222818      -2.874326
 5%    -.9016823      -2.874326
10%      .722874      -2.874326       Obs               1,000
25%     3.100177      -2.749146       Sum of wgt.       1,000

50%     6.438896                      Mean           7.025463
                        Largest       Std. dev.       5.31868
75%     10.12909        23.3844
90%     14.93419        23.3844       Variance       28.28836
95%     17.33498        24.3844       Skewness       .5813418
99%     20.69969        24.3844       Kurtosis       3.035987
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.807332   .3581067   -10.63   0.000    -4.510063   -3.104601
       exper |  -.0420536   .0958205    -0.44   0.661     -.230087    .1459799
      exper2 |    .000543   .0033943     0.16   0.873    -.0061179    .0072038
        year |   .5459542   .0585211     9.33   0.000     .4311151    .6607932
       _cons |   5.356206    .615891     8.70   0.000     4.147612    6.564801
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =   113.04
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =   113.04
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |     113.04    0.0000 |      113.60   0.0000 |      113.04

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=102.01   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     113.04

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      54.58     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     54.85     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     52.00     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =   178.94
                                                      Prob > F      =   0.0000
Total (centered) SS     =  287.4618179                Centered R2   =   0.7932
Total (uncentered) SS   =  54830.57311                Uncentered R2 =   0.9989
Residual SS             =  59.46030227                Root MSE      =    .2438

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0712708   .0047439    15.02   0.000      .061973    .0805686
       exper |   .0053266   .0048349     1.10   0.271    -.0041496    .0148028
      exper2 |   -.000208   .0001711    -1.22   0.224    -.0005435    .0001274
        year |   .0214173   .0039772     5.39   0.000     .0136221    .0292125
       _cons |   6.740539    .037194   181.23   0.000      6.66764    6.813438
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         102.015
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              113.036
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 946853760 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    9.47e+08           .   9.47e+08   9.47e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  946853760
                r(Var) =  .
                 r(sd) =  .
                r(min) =  946853760
                r(max) =  946853760
                r(sum) =  946853760


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 946853760



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(27 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.934051             -3
 5%    -.5989771             -3
10%     .5323281             -3       Obs               1,000
25%     2.404428             -3       Sum of wgt.       1,000

50%     5.685327                      Mean           6.920459
                        Largest       Std. dev.      5.891317
75%     10.78008       24.76096
90%     15.29041       24.76096       Variance       34.70762
95%     18.49627       24.76096       Skewness       .7845559
99%     23.50924       25.50924       Kurtosis       3.112432
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.600081   .3855194    -9.34   0.000    -4.356605   -2.843557
       exper |   .0126963   .1103977     0.12   0.908    -.2039427    .2293353
      exper2 |   .0043353   .0037395     1.16   0.247     -.003003    .0116736
        year |   .3607054   .0656458     5.49   0.000     .2318852    .4895256
       _cons |   4.716212   .7366448     6.40   0.000     3.270657    6.161768
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    87.20
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    87.20
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      87.20    0.0000 |       87.64   0.0000 |       87.20

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=80.58    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      87.20

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      54.98     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     55.26     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     52.36     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =   236.25
                                                      Prob > F      =   0.0000
Total (centered) SS     =  348.2414674                Centered R2   =   0.8388
Total (uncentered) SS   =  54882.39144                Uncentered R2 =   0.9990
Residual SS             =  56.14203958                Root MSE      =    .2369

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0796351   .0046742    17.04   0.000     .0704738    .0887963
       exper |   .0053303   .0048191     1.11   0.269    -.0041149    .0147755
      exper2 |   .0000226   .0001646     0.14   0.891    -.0003001    .0003453
        year |   .0108843   .0033015     3.30   0.001     .0044134    .0173552
       _cons |    6.69439   .0362527   184.66   0.000     6.623336    6.765444
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          80.579
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               87.203
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 254713472 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.55e+08           .   2.55e+08   2.55e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  254713472
                r(Var) =  .
                 r(sd) =  .
                r(min) =  254713472
                r(max) =  254713472
                r(sum) =  254713472


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 254713472



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(27 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.695639             -3
 5%    -.0767732      -2.749649
10%     .6775665      -2.690681       Obs               1,000
25%      2.67169      -2.322433       Sum of wgt.       1,000

50%     5.321821                      Mean           6.676471
                        Largest       Std. dev.      5.425337
75%     10.10869       22.35977
90%     14.76611       22.78683       Variance       29.43428
95%     17.65069       23.35977       Skewness       .8091568
99%      20.5733       24.35977       Kurtosis       2.971939
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.351218    .361261    -9.28   0.000    -4.060139   -2.642297
       exper |  -.2164392   .1012862    -2.14   0.033    -.4151982   -.0176802
      exper2 |   .0094935   .0033951     2.80   0.005     .0028311    .0161558
        year |   .4121506   .0609857     6.76   0.000     .2924753    .5318259
       _cons |   6.019802    .699401     8.61   0.000     4.647331    7.392272
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    86.05
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    86.05
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      86.05    0.0000 |       86.48   0.0000 |       86.05

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=79.60    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      86.05

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      52.48     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     52.74     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     50.10     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =   216.84
                                                      Prob > F      =   0.0000
Total (centered) SS     =  317.0662183                Centered R2   =   0.8286
Total (uncentered) SS   =  54117.52923                Uncentered R2 =   0.9990
Residual SS             =  54.33893324                Root MSE      =    .2331

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0810361   .0050086    16.18   0.000     .0712194    .0908527
       exper |   .0049566   .0048878     1.01   0.311    -.0046234    .0145366
      exper2 |   .0001754   .0001667     1.05   0.293    -.0001513    .0005021
        year |   .0058399    .003553     1.64   0.100    -.0011238    .0128037
       _cons |   6.646351   .0424199   156.68   0.000     6.563209    6.729492
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          79.601
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               86.052
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 679070912 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.79e+08           .   6.79e+08   6.79e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  679070912
                r(Var) =  .
                 r(sd) =  .
                r(min) =  679070912
                r(max) =  679070912
                r(sum) =  679070912


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 679070912



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(27 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -3             -3
 5%           -1             -3
10%            0             -3       Obs               1,000
25%     2.267107             -3       Sum of wgt.       1,000

50%     5.555648                      Mean           6.558902
                        Largest       Std. dev.      5.880533
75%       9.3732       25.41561
90%      14.5932       25.41561       Variance       34.58067
95%     18.75525       25.72136       Skewness       .9893014
99%      24.0913       26.72136       Kurtosis       3.817806
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.140947   .3945327    -7.96   0.000    -3.915159   -2.366736
       exper |   .2641641   .1145035     2.31   0.021     .0394679    .4888602
      exper2 |  -.0097555   .0040761    -2.39   0.017    -.0177541   -.0017569
        year |   .4754363   .0679898     6.99   0.000     .3420164    .6088562
       _cons |   3.355036   .7474941     4.49   0.000     1.888191    4.821882
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    63.38
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    63.38
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      63.38    0.0000 |       63.70   0.0000 |       63.38

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=59.88    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      63.38

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      17.05     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     17.13     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     16.85     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    84.92
                                                      Prob > F      =   0.0000
Total (centered) SS     =  330.3661487                Centered R2   =   0.6887
Total (uncentered) SS   =  54458.75211                Uncentered R2 =   0.9981
Residual SS             =  102.8459353                Root MSE      =    .3207

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0510067   .0072726     7.01   0.000     .0367527    .0652607
       exper |   .0280549   .0068325     4.11   0.000     .0146634    .0414464
      exper2 |   -.000846   .0002434    -3.48   0.001    -.0013231    -.000369
        year |   .0259416   .0052303     4.96   0.000     .0156904    .0361928
       _cons |   6.686218   .0471355   141.85   0.000     6.593834    6.778602
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          59.884
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               63.380
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 260885120 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.61e+08           .   2.61e+08   2.61e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  260885120
                r(Var) =  .
                 r(sd) =  .
                r(min) =  260885120
                r(max) =  260885120
                r(sum) =  260885120


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 260885120



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(28 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.843099      -2.714795
 5%     .7517768      -2.714795
10%     1.926616      -2.714795       Obs               1,000
25%     3.803177      -2.024681       Sum of wgt.       1,000

50%     6.626799                      Mean           7.526515
                        Largest       Std. dev.      5.170658
75%     10.26558       24.24988
90%     14.79699       24.24988       Variance        26.7357
95%     18.34941       24.24988       Skewness       .8541948
99%     22.51095       25.24988       Kurtosis       3.570591
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -.7445853   .3473188    -2.14   0.032    -1.426147   -.0630238
       exper |   .1977426   .1033293     1.91   0.056    -.0050259     .400511
      exper2 |  -.0062808   .0035571    -1.77   0.078    -.0132611    .0006995
        year |   .5058411   .0601091     8.42   0.000      .387886    .6237963
       _cons |   3.648449    .694251     5.26   0.000     2.286085    5.010813
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =     4.60
  Prob > F      =   0.0323
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =     4.60
  Prob > F      =   0.0323



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |       4.60    0.0323 |        4.62   0.0316 |        4.60

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=4.60     P-val=0.0320

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                       4.60

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       0.06     P-val=0.8135
Anderson-Rubin Wald test           Chi-sq(1)=      0.06     P-val=0.8129
Stock-Wright LM S statistic        Chi-sq(1)=      0.06     P-val=0.8130

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    24.25
                                                      Prob > F      =   0.0000
Total (centered) SS     =  303.4952938                Centered R2   =  -0.0793
Total (uncentered) SS   =  56046.02338                Uncentered R2 =   0.9942
Residual SS             =  327.5616713                Root MSE      =    .5723

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |  -.0116718   .0541742    -0.22   0.829    -.1178513    .0945076
       exper |    .026445   .0159241     1.66   0.097    -.0047657    .0576557
      exper2 |  -.0007714   .0005352    -1.44   0.149    -.0018204    .0002775
        year |   .0612816   .0285174     2.15   0.032     .0053885    .1171747
       _cons |   7.026167     .20463    34.34   0.000       6.6251    7.427235
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):           4.598
                                                   Chi-sq(1) P-val =    0.0320
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                4.596
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 347500640 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    3.48e+08           .   3.48e+08   3.48e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  347500640
                r(Var) =  .
                 r(sd) =  .
                r(min) =  347500640
                r(max) =  347500640
                r(sum) =  347500640


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 347500640



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(26 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.812052             -3
 5%           -1             -3
10%     .4558349             -3       Obs               1,000
25%     2.567806             -3       Sum of wgt.       1,000

50%     5.700293                      Mean           7.117532
                        Largest       Std. dev.      5.975603
75%      11.6237       22.82278
90%     15.95338       23.36448       Variance       35.70784
95%     18.77516       23.82278       Skewness       .6323137
99%     21.66798       24.36448       Kurtosis       2.579168
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -4.984263   .3900099   -12.78   0.000    -5.749599   -4.218927
       exper |   .2741347   .1197989     2.29   0.022     .0390472    .5092221
      exper2 |  -.0096127    .003959    -2.43   0.015    -.0173818   -.0018437
        year |   .4946401   .0663842     7.45   0.000     .3643709    .6249092
       _cons |   4.099688   .8259164     4.96   0.000      2.47895    5.720426
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =   163.32
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =   163.32
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |     163.32    0.0000 |      164.14   0.0000 |      163.32

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=141.00   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     163.32

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      37.28     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     37.46     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     36.11     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    98.40
                                                      Prob > F      =   0.0000
Total (centered) SS     =   325.325399                Centered R2   =   0.6824
Total (uncentered) SS   =   55628.5817                Uncentered R2 =   0.9981
Residual SS             =  103.3119743                Root MSE      =    .3214

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0474106   .0046681    10.16   0.000     .0382614    .0565599
       exper |   .0312838   .0071044     4.40   0.000     .0173595    .0452082
      exper2 |  -.0010393   .0002354    -4.42   0.000    -.0015006    -.000578
        year |   .0328615   .0046262     7.10   0.000     .0237943    .0419287
       _cons |   6.721623   .0526659   127.63   0.000       6.6184    6.824846
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         141.000
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              163.324
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 909239104 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    9.09e+08           .   9.09e+08   9.09e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  909239104
                r(Var) =  .
                 r(sd) =  .
                r(min) =  909239104
                r(max) =  909239104
                r(sum) =  909239104


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 909239104



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(32 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.349847             -3
 5%     -.339602      -2.960157
10%     .9927518      -2.960157       Obs               1,000
25%            3      -2.599333       Sum of wgt.       1,000

50%     6.729616                      Mean           7.540833
                        Largest       Std. dev.      5.733397
75%     11.78203       24.03706
90%     15.80939       25.03706       Variance       32.87184
95%     17.78953       26.03706       Skewness        .489498
99%     21.19483       27.03706       Kurtosis       2.555249
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |   -3.43635   .3539057    -9.71   0.000    -4.130838   -2.741863
       exper |  -.5692366    .100474    -5.67   0.000    -.7664018   -.3720714
      exper2 |   .0207371   .0034285     6.05   0.000     .0140093    .0274649
        year |   .5189785   .0629513     8.24   0.000     .3954461     .642511
       _cons |   8.725296   .6726377    12.97   0.000     7.405345    10.04525
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    94.28
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    94.28
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      94.28    0.0000 |       94.75   0.0000 |       94.28

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=86.55    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      94.28

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      31.74     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     31.90     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     30.92     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =   152.30
                                                      Prob > F      =   0.0000
Total (centered) SS     =  360.0602295                Centered R2   =   0.7646
Total (uncentered) SS   =  55303.97227                Uncentered R2 =   0.9985
Residual SS             =  84.77031247                Root MSE      =    .2912

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0618032   .0057389    10.77   0.000     .0505551    .0730512
       exper |  -.0073401     .00632    -1.16   0.245     -.019727    .0050469
      exper2 |   .0006608   .0002195     3.01   0.003     .0002305     .001091
        year |   .0152767   .0045772     3.34   0.001     .0063055    .0242479
       _cons |   6.808205   .0557049   122.22   0.000     6.699026    6.917385
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          86.553
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               94.280
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 477095616 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    4.77e+08           .   4.77e+08   4.77e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  477095616
                r(Var) =  .
                 r(sd) =  .
                r(min) =  477095616
                r(max) =  477095616
                r(sum) =  477095616


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 477095616



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(33 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.382085             -3
 5%           -1             -3
10%     .5867123      -2.421109       Obs               1,000
25%     2.151361      -2.421109       Sum of wgt.       1,000

50%     5.226089                      Mean           6.474339
                        Largest       Std. dev.      5.652963
75%     9.502065       22.86931
90%      15.2662       23.65368       Variance       31.95599
95%     17.86455       23.65368       Skewness       .8201852
99%     21.61625       23.86931       Kurtosis       3.052054
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.598787   .3595419    -7.23   0.000    -3.304335    -1.89324
       exper |    .007879    .111133     0.07   0.943    -.2102029     .225961
      exper2 |    .000335   .0037506     0.09   0.929     -.007025     .007695
        year |   .4840862   .0650505     7.44   0.000     .3564342    .6117382
       _cons |   4.455828   .7789723     5.72   0.000     2.927211    5.984446
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    52.24
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    52.24
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      52.24    0.0000 |       52.51   0.0000 |       52.24

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=49.89    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      52.24

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      16.48     P-val=0.0001
Anderson-Rubin Wald test           Chi-sq(1)=     16.56     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     16.29     P-val=0.0001

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    97.92
                                                      Prob > F      =   0.0000
Total (centered) SS     =  318.1705805                Centered R2   =   0.7349
Total (uncentered) SS   =  53762.85662                Uncentered R2 =   0.9984
Residual SS             =  84.33377426                Root MSE      =    .2904

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0564006   .0075387     7.48   0.000     .0416251    .0711762
       exper |   .0112075   .0060607     1.85   0.064    -.0006713    .0230862
      exper2 |  -.0002773   .0002042    -1.36   0.175    -.0006775     .000123
        year |   .0252751   .0050128     5.04   0.000     .0154502    .0350999
       _cons |   6.712867   .0477234   140.66   0.000      6.61933    6.806403
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          49.888
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               52.245
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 507134560 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    5.07e+08           .   5.07e+08   5.07e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  507134560
                r(Var) =  .
                 r(sd) =  .
                r(min) =  507134560
                r(max) =  507134560
                r(sum) =  507134560


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 507134560



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(21 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -2             -3
 5%     .0202274             -3
10%            1             -3       Obs               1,000
25%            3             -3       Sum of wgt.       1,000

50%     5.987633                      Mean           7.207152
                        Largest       Std. dev.      5.732824
75%     10.48907       25.92289
90%     15.34481       26.92289       Variance       32.86527
95%     18.81093       27.92289       Skewness       .8783831
99%     23.02526       27.92289       Kurtosis       3.478049
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.005716   .4309667    -4.65   0.000    -2.851424   -1.160008
       exper |   .0073721   .1066686     0.07   0.945    -.2019492    .2166933
      exper2 |   .0042946   .0037359     1.15   0.251    -.0030365    .0116256
        year |   .3736878   .0667678     5.60   0.000     .2426659    .5047098
       _cons |   4.523591   .6802063     6.65   0.000     3.188787    5.858394
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =    21.66
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =    21.66
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |      21.66    0.0000 |       21.77   0.0000 |       21.66

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=21.30    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      21.66

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=       2.23     P-val=0.1352
Anderson-Rubin Wald test           Chi-sq(1)=      2.25     P-val=0.1339
Stock-Wright LM S statistic        Chi-sq(1)=      2.24     P-val=0.1344

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =    60.91
                                                      Prob > F      =   0.0000
Total (centered) SS     =  358.5579326                Centered R2   =   0.5433
Total (uncentered) SS   =  54467.51294                Uncentered R2 =   0.9970
Residual SS             =  163.7501458                Root MSE      =    .4047

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0333105   .0159375     2.09   0.037     .0020737    .0645474
       exper |   .0140882   .0079008     1.78   0.075    -.0013971    .0295734
      exper2 |   .0000435   .0002909     0.15   0.881    -.0005267    .0006137
        year |   .0248945   .0078889     3.16   0.002     .0094324    .0403565
       _cons |   6.782867   .0864358    78.47   0.000     6.613455    6.952278
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          21.305
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               21.660
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 491576704 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    4.92e+08           .   4.92e+08   4.92e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  491576704
                r(Var) =  .
                 r(sd) =  .
                r(min) =  491576704
                r(max) =  491576704
                r(sum) =  491576704


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 1000 SEED: 491576704



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 1,000.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(900 real changes made)
(900 missing values generated)
(28 real changes made)
(900 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.958582             -3
 5%            0      -2.917164
10%     .9140825      -2.917164       Obs               1,000
25%     2.869627      -2.917164       Sum of wgt.       1,000

50%     6.629692                      Mean           7.855828
                        Largest       Std. dev.      6.221763
75%      12.3721        25.6989
90%      17.1111        26.6989       Variance       38.71033
95%     19.20756        26.6989       Skewness       .6532355
99%      23.8811        26.6989       Kurtosis       2.650676
(900 missing values generated)
(900 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   1000
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -4.975073    .393047   -12.66   0.000    -5.746369   -4.203777
       exper |   .3171553   .1154578     2.75   0.006     .0905865     .543724
      exper2 |  -.0123893   .0038578    -3.21   0.001    -.0199596    -.004819
        year |   .5518307   .0680171     8.11   0.000     .4183572    .6853042
       _cons |   4.698538   .8064632     5.83   0.000     3.115975    6.281102
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,   995) =   160.22
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,   995) =   160.22
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,   995)  P-val | SW Chi-sq(  1) P-val | SW F(  1,   995)
educ         |     160.22    0.0000 |      161.02   0.0000 |      160.22

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=138.69   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     160.22

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,995)=      73.51     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     73.88     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     68.80     P-val=0.0000

Number of observations               N  =       1000
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     1000
                                                      F(  4,   995) =   201.73
                                                      Prob > F      =   0.0000
Total (centered) SS     =  382.3995549                Centered R2   =   0.8228
Total (uncentered) SS   =  55445.90473                Uncentered R2 =   0.9988
Residual SS             =  67.76709218                Root MSE      =    .2603

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0695865    .003683    18.89   0.000     .0623679    .0768052
       exper |   .0045225   .0054915     0.82   0.410    -.0062406    .0152857
      exper2 |  -.0001085   .0001853    -0.59   0.558    -.0004716    .0002546
        year |   .0209432   .0037979     5.51   0.000     .0134994     .028387
       _cons |   6.719319   .0393973   170.55   0.000     6.642102    6.796537
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         138.690
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              160.218
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 533650272 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    5.34e+08           .   5.34e+08   5.34e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  533650272
                r(Var) =  .
                 r(sd) =  .
                r(min) =  533650272
                r(max) =  533650272
                r(sum) =  533650272


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 533650272



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(61 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.208518             -3
 5%     .2651093      -2.580411
10%     1.171964      -2.580411       Obs               2,500
25%      2.94802      -2.580411       Sum of wgt.       2,500

50%     5.913215                      Mean           7.448893
                        Largest       Std. dev.      5.939483
75%     11.16436       26.22169
90%     15.91034        26.3996       Variance       35.27746
95%     19.22169       26.82366       Skewness       .9307541
99%     24.69237       26.82366       Kurtosis       3.317858
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |   -1.63637   .2675924    -6.12   0.000    -2.161096   -1.111644
       exper |  -.2644219   .0783736    -3.37   0.001    -.4181059   -.1107379
      exper2 |   .0078538   .0025664     3.06   0.002     .0028213    .0128864
        year |   .5065298   .0446239    11.35   0.000      .419026    .5940335
       _cons |   6.921137   .5531872    12.51   0.000     5.836384     8.00589
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    37.40
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    37.40
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      37.40    0.0000 |       37.47   0.0000 |       37.40

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=36.92    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      37.40

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=      0.60     P-val=0.4375
Anderson-Rubin Wald test           Chi-sq(1)=      0.60     P-val=0.4370
Stock-Wright LM S statistic        Chi-sq(1)=      0.60     P-val=0.4370

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =    68.60
                                                      Prob > F      =   0.0000
Total (centered) SS     =  898.5622551                Centered R2   =   0.2818
Total (uncentered) SS   =  138246.8504                Uncentered R2 =   0.9953
Residual SS             =  645.3580801                Root MSE      =    .5081

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0127868   .0145269     0.88   0.379    -.0156854     .041259
       exper |  -.0177305   .0081879    -2.17   0.030    -.0337784   -.0016825
      exper2 |   .0007236   .0002594     2.79   0.005     .0002151     .001232
        year |   .0462125   .0085398     5.41   0.000     .0294748    .0629503
       _cons |   7.135793   .1098596    64.95   0.000     6.920472    7.351114
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          36.917
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               37.395
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +----------+
     |        a |
     |----------|
  1. | 99042072 |
     +----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    9.90e+07           .   9.90e+07   9.90e+07

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  99042072
                r(Var) =  .
                 r(sd) =  .
                r(min) =  99042072
                r(max) =  99042072
                r(sum) =  99042072


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 99042072



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(65 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.974758             -3
 5%     .0111296             -3
10%     1.011451      -2.971189       Obs               2,500
25%     3.257059      -2.894695       Sum of wgt.       2,500

50%     6.627337                      Mean           7.588553
                        Largest       Std. dev.      5.808309
75%     10.90431       25.22638
90%     16.42297       25.84074       Variance       33.73645
95%     19.22304       26.20283       Skewness       .7169063
99%     22.84074       27.20283       Kurtosis       2.976717
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.265645   .2446139   -13.35   0.000    -3.745312   -2.785978
       exper |    .078772   .0675223     1.17   0.243    -.0536336    .2111776
      exper2 |   .0011875   .0023387     0.51   0.612    -.0033985    .0057734
        year |   .4056722   .0414465     9.79   0.000     .3243991    .4869453
       _cons |   4.839653   .4505193    10.74   0.000     3.956223    5.723083
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   178.23
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   178.23
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     178.23    0.0000 |      178.59   0.0000 |      178.23

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=166.68   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     178.23

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     99.91     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=    100.11     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     96.25     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   544.34
                                                      Prob > F      =   0.0000
Total (centered) SS     =  862.7065995                Centered R2   =   0.8304
Total (uncentered) SS   =  138959.9371                Uncentered R2 =   0.9989
Residual SS             =  146.3256342                Root MSE      =    .2419

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0753818   .0033616    22.42   0.000     .0687931    .0819705
       exper |   .0036131   .0030445     1.19   0.235    -.0023541    .0095802
      exper2 |   .0002049    .000105     1.95   0.051    -8.93e-07    .0004106
        year |   .0101706   .0023005     4.42   0.000     .0056617    .0146794
       _cons |   6.706528   .0240052   279.38   0.000     6.659479    6.753577
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         166.679
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              178.228
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 268856832 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.69e+08           .   2.69e+08   2.69e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  268856832
                r(Var) =  .
                 r(sd) =  .
                r(min) =  268856832
                r(max) =  268856832
                r(sum) =  268856832


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 268856832



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(71 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -2             -3
 5%     .2205687             -3
10%      1.25173             -3       Obs               2,500
25%     3.487984             -3       Sum of wgt.       2,500

50%     6.368833                      Mean           7.603671
                        Largest       Std. dev.      5.675163
75%     10.90376        25.9348
90%     15.99307        25.9348       Variance       32.20748
95%     18.84846        26.9348       Skewness       .7965836
99%     23.00087        26.9348       Kurtosis       3.185058
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.388561   .2373613   -10.06   0.000    -2.854006   -1.923116
       exper |   .1070538   .0677263     1.58   0.114    -.0257519    .2398594
      exper2 |  -.0014181   .0023488    -0.60   0.546    -.0060238    .0031877
        year |   .4504943   .0409643    11.00   0.000     .3701668    .5308219
       _cons |    4.63456   .4558023    10.17   0.000      3.74077    5.528349
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   101.26
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   101.26
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     101.26    0.0000 |      101.47   0.0000 |      101.26

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=97.51    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     101.26

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     19.01     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     19.04     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     18.90     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   174.70
                                                      Prob > F      =   0.0000
Total (centered) SS     =  823.9283833                Centered R2   =   0.6401
Total (uncentered) SS   =  138886.7166                Uncentered R2 =   0.9979
Residual SS             =  296.5285862                Root MSE      =    .3444

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0441534   .0064011     6.90   0.000     .0316076    .0566992
       exper |   .0108462   .0044425     2.44   0.015     .0021391    .0195533
      exper2 |  -.0001649   .0001517    -1.09   0.277    -.0004623    .0001325
        year |   .0279361    .003847     7.26   0.000     .0203962     .035476
       _cons |   6.828841   .0375543   181.84   0.000     6.755236    6.902446
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          97.509
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              101.263
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 497279776 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    4.97e+08           .   4.97e+08   4.97e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  497279776
                r(Var) =  .
                 r(sd) =  .
                r(min) =  497279776
                r(max) =  497279776
                r(sum) =  497279776


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 497279776



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(60 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.796162             -3
 5%     .1819141             -3
10%     1.071158             -3       Obs               2,500
25%     3.002111      -2.903847       Sum of wgt.       2,500

50%      6.01224                      Mean            7.45294
                        Largest       Std. dev.      5.836889
75%      10.8789       26.39156
90%     15.95553       27.39156       Variance       34.06927
95%     18.93784       28.39156       Skewness         .86032
99%     24.18327       29.39156       Kurtosis         3.2312
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.145212   .2621122    -8.18   0.000    -2.659192   -1.631232
       exper |   .0420648   .0720337     0.58   0.559    -.0991871    .1833167
      exper2 |  -.0021682   .0025073    -0.86   0.387    -.0070849    .0027484
        year |   .5220444     .04329    12.06   0.000     .4371563    .6069325
       _cons |   4.997377   .4870852    10.26   0.000     4.042244    5.952509
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    66.98
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    66.98
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      66.98    0.0000 |       67.12   0.0000 |       66.98

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=65.36    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      66.98

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     17.76     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     17.80     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     17.67     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   174.27
                                                      Prob > F      =   0.0000
Total (centered) SS     =  873.8298808                Centered R2   =   0.6928
Total (uncentered) SS   =  139039.3424                Uncentered R2 =   0.9981
Residual SS             =  268.4738931                Root MSE      =    .3277

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0522523   .0071809     7.28   0.000     .0381781    .0663266
       exper |    .015025   .0042313     3.55   0.000     .0067319    .0233181
      exper2 |  -.0003346    .000148    -2.26   0.024    -.0006246   -.0000446
        year |   .0244819   .0046387     5.28   0.000     .0153903    .0335735
       _cons |   6.777023   .0440256   153.93   0.000     6.690734    6.863311
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          65.363
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               66.983
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +----------+
     |        a |
     |----------|
  1. | 23557546 |
     +----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.36e+07           .   2.36e+07   2.36e+07

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  23557546
                r(Var) =  .
                 r(sd) =  .
                r(min) =  23557546
                r(max) =  23557546
                r(sum) =  23557546


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 23557546



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(46 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.693626             -3
 5%     .0947857             -3
10%     1.110217      -2.861061       Obs               2,500
25%            3       -2.55291       Sum of wgt.       2,500

50%      6.04943                      Mean           7.596813
                        Largest       Std. dev.      6.093353
75%     10.91488       26.40628
90%     17.53995        26.6404       Variance       37.12895
95%     19.94816        27.6404       Skewness       .8799654
99%     23.39421        27.6404       Kurtosis       3.057697
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.747614   .2965522   -12.64   0.000    -4.329128   -3.166101
       exper |   .1348703   .0720776     1.87   0.061    -.0064678    .2762084
      exper2 |  -.0043776   .0025023    -1.75   0.080    -.0092843    .0005291
        year |   .4611904   .0442881    10.41   0.000     .3743453    .5480356
       _cons |    4.89551   .4704543    10.41   0.000     3.972989    5.818031
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   159.70
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   159.70
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     159.70    0.0000 |      160.02   0.0000 |      159.70

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=150.39   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     159.70

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     99.04     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     99.24     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     95.45     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   465.53
                                                      Prob > F      =   0.0000
Total (centered) SS     =  909.8632195                Centered R2   =   0.8512
Total (uncentered) SS   =  138502.2615                Uncentered R2 =   0.9990
Residual SS             =  135.4155944                Root MSE      =    .2327

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0779473   .0032017    24.35   0.000     .0716721    .0842226
       exper |   .0151059   .0029438     5.13   0.000     .0093361    .0208758
      exper2 |  -.0003106   .0001023    -3.04   0.002    -.0005111   -.0001102
        year |   .0105531   .0023501     4.49   0.000      .005947    .0151592
       _cons |   6.633713   .0233681   283.88   0.000     6.587913    6.679514
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         150.394
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              159.701
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 275364608 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.75e+08           .   2.75e+08   2.75e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  275364608
                r(Var) =  .
                 r(sd) =  .
                r(min) =  275364608
                r(max) =  275364608
                r(sum) =  275364608


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 275364608



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(64 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.215359             -3
 5%            0             -3
10%     .8701879             -3       Obs               2,500
25%     2.814179             -3       Sum of wgt.       2,500

50%     5.770704                      Mean           7.246731
                        Largest       Std. dev.      5.988011
75%     10.75174       27.42289
90%     15.91185       28.42289       Variance       35.85627
95%     19.17636       29.42289       Skewness       .9003656
99%     23.91149       29.42289       Kurtosis        3.33623
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.697836   .2586805   -10.43   0.000    -3.205086   -2.190585
       exper |   .0286954     .06928     0.41   0.679    -.1071568    .1645477
      exper2 |   -.004002   .0023938    -1.67   0.095    -.0086962    .0006921
        year |    .582287   .0432861    13.45   0.000     .4974066    .6671674
       _cons |   5.262927   .4600025    11.44   0.000     4.360902    6.164953
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   108.77
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   108.77
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     108.77    0.0000 |      108.99   0.0000 |      108.77

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=104.43   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     108.77

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     44.80     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     44.89     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     44.10     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   276.11
                                                      Prob > F      =   0.0000
Total (centered) SS     =  881.7673458                Centered R2   =   0.7881
Total (uncentered) SS   =  137132.3118                Uncentered R2 =   0.9986
Residual SS             =  186.8378269                Root MSE      =    .2734

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0641046   .0046265    13.86   0.000     .0550368    .0731724
       exper |   .0032429   .0033434     0.97   0.332    -.0033101    .0097959
      exper2 |   .0000717   .0001168     0.61   0.539    -.0001572    .0003007
        year |   .0196074     .00342     5.73   0.000     .0129044    .0263105
       _cons |   6.747456   .0307604   219.35   0.000     6.687167    6.807745
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         104.434
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              108.769
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 219794816 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.20e+08           .   2.20e+08   2.20e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  219794816
                r(Var) =  .
                 r(sd) =  .
                r(min) =  219794816
                r(max) =  219794816
                r(sum) =  219794816


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 219794816



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(63 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.161155             -3
 5%            0             -3
10%            1             -3       Obs               2,500
25%     3.140588      -2.889648       Sum of wgt.       2,500

50%     6.328199                      Mean           7.427971
                        Largest       Std. dev.      5.733666
75%     10.99707       25.45685
90%     15.94798       26.45685       Variance       32.87492
95%     18.42766       26.45685       Skewness       .7268458
99%     22.80465       27.45685       Kurtosis       2.977437
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |   -2.85976   .2484952   -11.51   0.000    -3.347038   -2.372482
       exper |   .0933305   .0694917     1.34   0.179    -.0429367    .2295978
      exper2 |  -.0017857   .0024056    -0.74   0.458    -.0065029    .0029315
        year |   .4569921   .0415709    10.99   0.000     .3754751    .5385091
       _cons |   4.729833   .4705086    10.05   0.000     3.807205     5.65246
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   132.44
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   132.44
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     132.44    0.0000 |      132.71   0.0000 |      132.44

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=126.02   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     132.44

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     34.95     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     35.02     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     34.54     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   221.83
                                                      Prob > F      =   0.0000
Total (centered) SS     =  842.4979545                Centered R2   =   0.6995
Total (uncentered) SS   =  138172.5824                Uncentered R2 =   0.9982
Residual SS             =  253.1528791                Root MSE      =    .3182

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0522065    .005117    10.20   0.000     .0421773    .0622357
       exper |   .0168948   .0041166     4.10   0.000     .0088265    .0249631
      exper2 |  -.0002457    .000142    -1.73   0.084    -.0005239    .0000326
        year |   .0202637   .0034097     5.94   0.000     .0135808    .0269465
       _cons |   6.731979   .0344201   195.58   0.000     6.664517    6.799441
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         126.017
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              132.441
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +----------+
     |        a |
     |----------|
  1. | 60930492 |
     +----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.09e+07           .   6.09e+07   6.09e+07

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  60930492
                r(Var) =  .
                 r(sd) =  .
                r(min) =  60930492
                r(max) =  60930492
                r(sum) =  60930492


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 60930492



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(66 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -2             -3
 5%     .1509913             -3
10%     1.143822             -3       Obs               2,500
25%     3.125244      -2.843741       Sum of wgt.       2,500

50%     6.471496                      Mean           7.935992
                        Largest       Std. dev.      6.298831
75%     11.64779       27.48277
90%     17.79851       28.48277       Variance       39.67527
95%     20.59094       29.48277       Skewness       .8208076
99%     24.67615       29.48277       Kurtosis       3.021917
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.366589    .268334   -12.55   0.000    -3.892769   -2.840408
       exper |  -.0703317   .0779101    -0.90   0.367    -.2231068    .0824435
      exper2 |   .0013863   .0026636     0.52   0.603    -.0038368    .0066094
        year |   .5588301    .046101    12.12   0.000     .4684301    .6492302
       _cons |   6.414393   .5488319    11.69   0.000      5.33818    7.490605
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   157.41
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   157.41
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     157.41    0.0000 |      157.72   0.0000 |      157.41

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=148.36   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     157.41

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     73.98     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     74.12     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     71.99     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   355.18
                                                      Prob > F      =   0.0000
Total (centered) SS     =  951.5927593                Centered R2   =   0.8179
Total (uncentered) SS   =  140398.4427                Uncentered R2 =   0.9988
Residual SS             =  173.2692496                Root MSE      =    .2633

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0676663   .0035424    19.10   0.000     .0607233    .0746092
       exper |  -.0104858   .0034735    -3.02   0.003    -.0172938   -.0036778
      exper2 |   .0005024   .0001184     4.24   0.000     .0002702    .0007345
        year |    .018061   .0028858     6.26   0.000     .0124048    .0237171
       _cons |   6.856317   .0313546   218.67   0.000     6.794863     6.91777
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         148.364
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              157.409
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +----------+
     |        a |
     |----------|
  1. | 71003128 |
     +----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    7.10e+07           .   7.10e+07   7.10e+07

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  71003128
                r(Var) =  .
                 r(sd) =  .
                r(min) =  71003128
                r(max) =  71003128
                r(sum) =  71003128


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 71003128



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(65 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.979765             -3
 5%            0             -3
10%            1             -3       Obs               2,500
25%            3             -3       Sum of wgt.       2,500

50%     6.264304                      Mean           7.389634
                        Largest       Std. dev.      5.794436
75%     10.74934       25.84565
90%     15.98065       26.84565       Variance       33.57549
95%     18.73592       26.84565       Skewness       .7810335
99%     23.18854       27.84565       Kurtosis       3.133178
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |    -3.0897   .2485607   -12.43   0.000    -3.577106   -2.602293
       exper |  -.0224102   .0728602    -0.31   0.758    -.1652829    .1204624
      exper2 |   .0005968   .0025381     0.24   0.814    -.0043803    .0055739
        year |   .4892104   .0424637    11.52   0.000     .4059428     .572478
       _cons |   5.657602   .4867615    11.62   0.000     4.703104    6.612101
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   154.51
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   154.51
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     154.51    0.0000 |      154.82   0.0000 |      154.51

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=145.79   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     154.51

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     42.66     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     42.74     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     42.02     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   202.10
                                                      Prob > F      =   0.0000
Total (centered) SS     =  809.6131645                Centered R2   =   0.7050
Total (uncentered) SS   =  138313.1018                Uncentered R2 =   0.9983
Residual SS             =   238.819976                Root MSE      =    .3091

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0521478   .0045553    11.45   0.000     .0432194    .0610761
       exper |   .0043353   .0041246     1.05   0.293    -.0037487    .0124194
      exper2 |  -.0000159   .0001437    -0.11   0.912    -.0002974    .0002657
        year |    .025945   .0033071     7.85   0.000     .0194631    .0324269
       _cons |   6.830743   .0348094   196.23   0.000     6.762518    6.898968
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         145.795
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              154.514
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +----------+
     |        a |
     |----------|
  1. | 12378922 |
     +----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    1.24e+07           .   1.24e+07   1.24e+07

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  12378922
                r(Var) =  .
                 r(sd) =  .
                r(min) =  12378922
                r(max) =  12378922
                r(sum) =  12378922


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 12378922



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(65 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.248988      -2.549215
 5%     .5518196      -2.315376
10%     1.590517      -2.315376       Obs               2,500
25%     3.548612      -2.304713       Sum of wgt.       2,500

50%     6.274316                      Mean           7.617943
                        Largest       Std. dev.      5.503988
75%     10.93955       25.25971
90%     15.77786       25.69164       Variance       30.29388
95%     18.55239       26.25971       Skewness       .7862159
99%     22.42125       26.69164       Kurtosis       3.040956
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -1.596753   .2411767    -6.62   0.000     -2.06968   -1.123826
       exper |   .0434209   .0670444     0.65   0.517    -.0880474    .1748892
      exper2 |  -.0003479    .002268    -0.15   0.878    -.0047952    .0040994
        year |    .475266   .0401244    11.84   0.000     .3965854    .5539466
       _cons |   4.868037   .4640406    10.49   0.000     3.958093    5.777981
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    43.83
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    43.83
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      43.83    0.0000 |       43.92   0.0000 |       43.83

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=43.16    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      43.83

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=      4.81     P-val=0.0284
Anderson-Rubin Wald test           Chi-sq(1)=      4.82     P-val=0.0282
Stock-Wright LM S statistic        Chi-sq(1)=      4.81     P-val=0.0283

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   120.86
                                                      Prob > F      =   0.0000
Total (centered) SS     =  836.5571548                Centered R2   =   0.5404
Total (uncentered) SS   =   138863.033                Uncentered R2 =   0.9972
Residual SS             =  384.4780231                Root MSE      =    .3922

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0348469   .0112775     3.09   0.002     .0127433    .0569505
       exper |   .0006314   .0050888     0.12   0.901    -.0093425    .0106052
      exper2 |   .0001861   .0001698     1.10   0.273    -.0001466    .0005189
        year |    .033055   .0060241     5.49   0.000      .021248     .044862
       _cons |   6.926583   .0572486   120.99   0.000     6.814377    7.038788
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          43.163
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               43.833
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 606323840 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.06e+08           .   6.06e+08   6.06e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  606323840
                r(Var) =  .
                 r(sd) =  .
                r(min) =  606323840
                r(max) =  606323840
                r(sum) =  606323840


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 606323840



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(61 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.380959             -3
 5%     .1867763             -3
10%     1.108336             -3       Obs               2,500
25%     2.940218             -3       Sum of wgt.       2,500

50%     5.913074                      Mean           7.106846
                        Largest       Std. dev.      5.639691
75%     10.23802       25.32796
90%     15.42999       26.08967       Variance       31.80611
95%     18.81548       26.32796       Skewness       .8810139
99%     23.08967       27.32796       Kurtosis        3.39215
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.097189   .2452838   -12.63   0.000     -3.57817   -2.616208
       exper |  -.2892803   .0673613    -4.29   0.000    -.4213701   -.1571906
      exper2 |   .0073926   .0023497     3.15   0.002      .002785    .0120003
        year |   .5841422   .0407613    14.33   0.000     .5042128    .6640716
       _cons |   6.881129   .4421329    15.56   0.000     6.014143    7.748114
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   159.44
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   159.44
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     159.44    0.0000 |      159.76   0.0000 |      159.44

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=150.16   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     159.44

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     57.58     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     57.70     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     56.40     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   269.95
                                                      Prob > F      =   0.0000
Total (centered) SS     =  851.6257561                Centered R2   =   0.7683
Total (uncentered) SS   =  136121.5858                Uncentered R2 =   0.9986
Residual SS             =  197.3001968                Root MSE      =    .2809

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0631478   .0042185    14.97   0.000     .0548798    .0714158
       exper |   .0068775    .003685     1.87   0.062     -.000345    .0140999
      exper2 |   .0000641   .0001265     0.51   0.612    -.0001838    .0003121
        year |   .0163387    .003235     5.05   0.000     .0099983    .0226792
       _cons |   6.710146   .0333185   201.39   0.000     6.644843    6.775449
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         150.164
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              159.440
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 407626656 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    4.08e+08           .   4.08e+08   4.08e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  407626656
                r(Var) =  .
                 r(sd) =  .
                r(min) =  407626656
                r(max) =  407626656
                r(sum) =  407626656


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 407626656



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(61 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.773668             -3
 5%     .0355139             -3
10%     1.118854             -3       Obs               2,500
25%     3.203219             -3       Sum of wgt.       2,500

50%     6.577704                      Mean           7.768592
                        Largest       Std. dev.      5.909445
75%     11.74167        26.5248
90%      16.3995       26.83614       Variance       34.92155
95%     19.35734        27.5248       Skewness       .6446827
99%     22.39548       27.83614       Kurtosis       2.764459
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.851402   .2597255   -10.98   0.000    -3.360702   -2.342103
       exper |  -.2626087   .0760507    -3.45   0.001    -.4117377   -.1134797
      exper2 |   .0087217   .0025611     3.41   0.001     .0036997    .0137437
        year |   .5060506   .0433452    11.67   0.000     .4210543    .5910469
       _cons |   7.286532   .5131469    14.20   0.000     6.280294    8.292769
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   120.53
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   120.53
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     120.53    0.0000 |      120.77   0.0000 |      120.53

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=115.20   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     120.53

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     53.64     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     53.75     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     52.62     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   319.23
                                                      Prob > F      =   0.0000
Total (centered) SS     =  925.6842682                Centered R2   =   0.8164
Total (uncentered) SS   =  138823.2083                Uncentered R2 =   0.9988
Residual SS             =  169.9252377                Root MSE      =    .2607

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0691059   .0042429    16.29   0.000       .06079    .0774217
       exper |   .0028472   .0036983     0.77   0.441    -.0044013    .0100957
      exper2 |   .0000346    .000124     0.28   0.780    -.0002085    .0002777
        year |   .0188446   .0029632     6.36   0.000     .0130369    .0246524
       _cons |   6.737546   .0365084   184.55   0.000     6.665991    6.809101
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         115.204
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              120.528
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 942547520 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    9.43e+08           .   9.43e+08   9.43e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  942547520
                r(Var) =  .
                 r(sd) =  .
                r(min) =  942547520
                r(max) =  942547520
                r(sum) =  942547520


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 942547520



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(56 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -2             -3
 5%      .173229      -2.885558
10%     1.249887      -2.769863       Obs               2,500
25%     3.353086       -2.71954       Sum of wgt.       2,500

50%     6.349933                      Mean           7.392065
                        Largest       Std. dev.      5.515421
75%      10.4667       26.94454
90%     15.30891       26.94454       Variance       30.41987
95%      17.9314        27.7799       Skewness       .8390687
99%     23.63939        27.7799       Kurtosis       3.470144
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.338893   .2503526    -9.34   0.000    -2.829813   -1.847973
       exper |  -.1053266   .0656288    -1.60   0.109    -.2340192    .0233659
      exper2 |   .0032219   .0022588     1.43   0.154    -.0012074    .0076512
        year |   .5115865   .0403242    12.69   0.000     .4325142    .5906588
       _cons |   5.795819   .4582805    12.65   0.000      4.89717    6.694468
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    87.28
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    87.28
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      87.28    0.0000 |       87.46   0.0000 |       87.28

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=84.50    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      87.28

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     37.91     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     37.98     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     37.42     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   288.21
                                                      Prob > F      =   0.0000
Total (centered) SS     =  824.4549099                Centered R2   =   0.7862
Total (uncentered) SS   =  138429.5694                Uncentered R2 =   0.9987
Residual SS             =  176.2715723                Root MSE      =    .2655

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0687503   .0054334    12.65   0.000      .058101    .0793995
       exper |   .0145748   .0033712     4.32   0.000     .0079674    .0211822
      exper2 |  -.0003464   .0001158    -2.99   0.003    -.0005733   -.0001195
        year |   .0180957   .0034449     5.25   0.000     .0113439    .0248475
       _cons |   6.686457   .0364612   183.39   0.000     6.614994     6.75792
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          84.499
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               87.280
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 673084096 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.73e+08           .   6.73e+08   6.73e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  673084096
                r(Var) =  .
                 r(sd) =  .
                r(min) =  673084096
                r(max) =  673084096
                r(sum) =  673084096


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 673084096



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(64 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.988525             -3
 5%     .0233415             -3
10%            1             -3       Obs               2,500
25%       3.1568             -3       Sum of wgt.       2,500

50%     6.306479                      Mean           7.518154
                        Largest       Std. dev.      5.803969
75%     11.37294       25.87953
90%     15.85267       25.87953       Variance       33.68605
95%     18.47131       26.87953       Skewness       .7382372
99%     23.20335       27.87953       Kurtosis       2.994637
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |   -2.20634   .2536795    -8.70   0.000    -2.703784   -1.708896
       exper |  -.0571894   .0724449    -0.79   0.430    -.1992476    .0848689
      exper2 |  -.0008251   .0024757    -0.33   0.739    -.0056797    .0040294
        year |   .5680645   .0424415    13.38   0.000     .4848403    .6512887
       _cons |   5.935131   .4877899    12.17   0.000     4.978617    6.891646
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    75.64
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    75.64
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      75.64    0.0000 |       75.80   0.0000 |       75.64

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=73.57    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      75.64

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     24.71     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     24.76     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     24.52     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   215.31
                                                      Prob > F      =   0.0000
Total (centered) SS     =  798.2169413                Centered R2   =   0.7309
Total (uncentered) SS   =  139162.7834                Uncentered R2 =   0.9985
Residual SS             =  214.8095783                Root MSE      =    .2931

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0556703   .0060937     9.14   0.000     .0437268    .0676138
       exper |   .0067433   .0038496     1.75   0.080    -.0008017    .0142883
      exper2 |   .0000152   .0001313     0.12   0.908    -.0002423    .0002726
        year |   .0215083   .0041053     5.24   0.000     .0134621    .0295545
       _cons |   6.803057   .0410852   165.58   0.000     6.722531    6.883582
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          73.565
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               75.644
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +----------+
     |        a |
     |----------|
  1. | 35101440 |
     +----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    3.51e+07           .   3.51e+07   3.51e+07

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  35101440
                r(Var) =  .
                 r(sd) =  .
                r(min) =  35101440
                r(max) =  35101440
                r(sum) =  35101440


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 35101440



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(57 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.988092             -3
 5%     .0274624             -3
10%     1.076367      -2.969867       Obs               2,500
25%     3.204457      -2.969867       Sum of wgt.       2,500

50%     6.349566                      Mean            7.59931
                        Largest       Std. dev.       5.84145
75%     11.35332        24.9325
90%     16.16425       25.01524       Variance       34.12254
95%     19.22522       26.01524       Skewness       .7119177
99%     22.59847       27.01524       Kurtosis       2.845932
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |   -3.12527   .2622205   -11.92   0.000    -3.639462   -2.611077
       exper |   .0782376   .0723618     1.08   0.280    -.0636578    .2201329
      exper2 |  -.0039211   .0025177    -1.56   0.119    -.0088581    .0010159
        year |   .5155767   .0425374    12.12   0.000     .4321645    .5989889
       _cons |   5.282586    .472672    11.18   0.000     4.355717    6.209456
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   142.05
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   142.05
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     142.05    0.0000 |      142.33   0.0000 |      142.05

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=134.67   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     142.05

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     66.26     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     66.39     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     64.67     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   340.71
                                                      Prob > F      =   0.0000
Total (centered) SS     =  898.0915678                Centered R2   =   0.8219
Total (uncentered) SS   =  138330.1075                Uncentered R2 =   0.9988
Residual SS             =   159.953445                Root MSE      =    .2529

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0706027   .0038488    18.34   0.000     .0630591    .0781462
       exper |   .0030147   .0033185     0.91   0.364    -.0034893    .0095188
      exper2 |   .0000378   .0001158     0.33   0.744    -.0001892    .0002648
        year |   .0174586   .0027913     6.25   0.000     .0119878    .0229294
       _cons |   6.731153    .028463   236.49   0.000     6.675367     6.78694
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         134.668
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              142.050
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 223591296 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.24e+08           .   2.24e+08   2.24e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  223591296
                r(Var) =  .
                 r(sd) =  .
                r(min) =  223591296
                r(max) =  223591296
                r(sum) =  223591296


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 223591296



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(47 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.650892             -3
 5%     .4406495             -3
10%     1.439915      -2.650892       Obs               2,500
25%      3.43918       -2.55935       Sum of wgt.       2,500

50%     6.345668                      Mean           7.818894
                        Largest       Std. dev.      6.063907
75%     10.59875       27.63581
90%     17.44936       27.63581       Variance       36.77097
95%     20.51816       27.71519       Skewness       1.058897
99%      25.6755       28.24014       Kurtosis       3.744176
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.433999   .2970006    -8.20   0.000    -3.016392   -1.851606
       exper |   -.141476   .0730779    -1.94   0.053    -.2847756    .0018236
      exper2 |   .0065094   .0024835     2.62   0.009     .0016394    .0113794
        year |   .4505885   .0442858    10.17   0.000     .3637478    .5374292
       _cons |   6.193272   .4912285    12.61   0.000     5.230015     7.15653
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    67.16
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    67.16
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      67.16    0.0000 |       67.30   0.0000 |       67.16

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=65.53    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      67.16

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=      3.48     P-val=0.0623
Anderson-Rubin Wald test           Chi-sq(1)=      3.49     P-val=0.0619
Stock-Wright LM S statistic        Chi-sq(1)=      3.48     P-val=0.0621

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =    87.08
                                                      Prob > F      =   0.0000
Total (centered) SS     =  902.5393669                Centered R2   =   0.4186
Total (uncentered) SS   =  139068.5119                Uncentered R2 =   0.9962
Residual SS             =   524.762625                Root MSE      =    .4582

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0226058   .0096312     2.35   0.019     .0037289    .0414826
       exper |   .0025572   .0059099     0.43   0.665     -.009026    .0141404
      exper2 |   .0001508   .0002058     0.73   0.464    -.0002526    .0005542
        year |    .037996   .0055157     6.89   0.000     .0271855    .0488066
       _cons |   6.974384   .0667589   104.47   0.000     6.843539     7.10523
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          65.533
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               67.162
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 845597504 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    8.46e+08           .   8.46e+08   8.46e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  845597504
                r(Var) =  .
                 r(sd) =  .
                r(min) =  845597504
                r(max) =  845597504
                r(sum) =  845597504


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 845597504



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(68 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.508126             -3
 5%            0             -3
10%            1             -3       Obs               2,500
25%     3.157363      -2.508126       Sum of wgt.       2,500

50%     6.501262                      Mean           7.751618
                        Largest       Std. dev.      5.971715
75%     11.66315       27.30425
90%      16.4391       28.30425       Variance       35.66137
95%     19.79411       28.30425       Skewness       .7057196
99%     23.22145       28.30425       Kurtosis       2.861999
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -1.879896   .2570561    -7.31   0.000    -2.383961    -1.37583
       exper |  -.1239038   .0738135    -1.68   0.093    -.2686459    .0208382
      exper2 |   .0070608   .0025764     2.74   0.006     .0020087    .0121129
        year |   .4204634   .0441359     9.53   0.000     .3339168    .5070101
       _cons |   6.007217   .4893295    12.28   0.000     5.047683    6.966751
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    53.48
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    53.48
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      53.48    0.0000 |       53.59   0.0000 |       53.48

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=52.47    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      53.48

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=      0.07     P-val=0.7971
Anderson-Rubin Wald test           Chi-sq(1)=      0.07     P-val=0.7969
Stock-Wright LM S statistic        Chi-sq(1)=      0.07     P-val=0.7969

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =    66.47
                                                      Prob > F      =   0.0000
Total (centered) SS     =  877.7816998                Centered R2   =   0.1485
Total (uncentered) SS   =  139292.7294                Uncentered R2 =   0.9946
Residual SS             =  747.4120524                Root MSE      =    .5468

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0034768   .0130731     0.27   0.790     -.022146    .0290996
       exper |  -.0161892   .0071918    -2.25   0.024    -.0302848   -.0020935
      exper2 |   .0009621   .0002603     3.70   0.000     .0004519    .0014723
        year |   .0435993   .0069423     6.28   0.000     .0299927    .0572059
       _cons |   7.172857   .0842764    85.11   0.000     7.007678    7.338036
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          52.465
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               53.483
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 899241920 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    8.99e+08           .   8.99e+08   8.99e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  899241920
                r(Var) =  .
                 r(sd) =  .
                r(min) =  899241920
                r(max) =  899241920
                r(sum) =  899241920


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 899241920



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(61 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.000305             -3
 5%    -.0335606             -3
10%     .8617397             -3       Obs               2,500
25%     2.912397             -3       Sum of wgt.       2,500

50%     6.032838                      Mean           7.212796
                        Largest       Std. dev.      5.759307
75%     10.52636       27.43453
90%     15.77929       27.43453       Variance       33.16962
95%     18.85598       28.43453       Skewness       .8002559
99%     22.14178       28.43453       Kurtosis       3.131593
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |   -3.95862   .2467348   -16.04   0.000    -4.442446   -3.474794
       exper |  -.0213237   .0718574    -0.30   0.767      -.16223    .1195826
      exper2 |   .0001215   .0024426     0.05   0.960    -.0046682    .0049113
        year |   .5192313   .0413556    12.56   0.000     .4381366    .6003261
       _cons |   5.571078   .4808924    11.58   0.000     4.628089    6.514068
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   257.41
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   257.41
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     257.41    0.0000 |      257.93   0.0000 |      257.41

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=233.80   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     257.41

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     97.62     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     97.82     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     94.13     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   297.80
                                                      Prob > F      =   0.0000
Total (centered) SS     =  856.7256925                Centered R2   =   0.7607
Total (uncentered) SS   =  138139.3964                Uncentered R2 =   0.9985
Residual SS             =  205.0463648                Root MSE      =    .2864

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0639705   .0033622    19.03   0.000     .0573807    .0705603
       exper |   .0052553   .0038769     1.36   0.175    -.0023432    .0128537
      exper2 |  -.0000701   .0001318    -0.53   0.595    -.0003283    .0001882
        year |   .0212381   .0028188     7.53   0.000     .0157134    .0267628
       _cons |   6.774584    .029985   225.93   0.000     6.715815    6.833354
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         233.805
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              257.411
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 289179552 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.89e+08           .   2.89e+08   2.89e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  289179552
                r(Var) =  .
                 r(sd) =  .
                r(min) =  289179552
                r(max) =  289179552
                r(sum) =  289179552


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 289179552



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(63 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.224792             -3
 5%            0             -3
10%     1.018928             -3       Obs               2,500
25%     2.965061             -3       Sum of wgt.       2,500

50%     5.407976                      Mean           6.810409
                        Largest       Std. dev.      5.718473
75%     9.249675       29.01439
90%     15.44608       29.01439       Variance       32.70094
95%     19.18052       29.01439       Skewness       1.188691
99%     24.21965       29.01439       Kurtosis       4.311754
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.781388   .2512211   -11.07   0.000    -3.274011   -2.288764
       exper |   .0284727    .068819     0.41   0.679    -.1064754    .1634209
      exper2 |   -.000208   .0023483    -0.09   0.929    -.0048128    .0043968
        year |   .4934238   .0416494    11.85   0.000     .4117528    .5750949
       _cons |    4.42626   .4824483     9.17   0.000     3.480219      5.3723
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   122.58
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   122.58
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     122.58    0.0000 |      122.82   0.0000 |      122.58

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=117.07   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     122.58

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     63.78     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     63.91     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     62.32     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   375.01
                                                      Prob > F      =   0.0000
Total (centered) SS     =  828.8331574                Centered R2   =   0.8047
Total (uncentered) SS   =  135913.3249                Uncentered R2 =   0.9988
Residual SS             =   161.912319                Root MSE      =    .2545

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0725735    .004271    16.99   0.000     .0642025    .0809445
       exper |   .0062691   .0032705     1.92   0.055     -.000141    .0126791
      exper2 |  -.0000617   .0001111    -0.55   0.579    -.0002794    .0001561
        year |   .0165645   .0027712     5.98   0.000      .011133     .021996
       _cons |   6.690253   .0258099   259.21   0.000     6.639667     6.74084
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         117.072
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              122.577
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 523274304 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    5.23e+08           .   5.23e+08   5.23e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  523274304
                r(Var) =  .
                 r(sd) =  .
                r(min) =  523274304
                r(max) =  523274304
                r(sum) =  523274304


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 523274304



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(64 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%           -2             -3
 5%            0             -3
10%     1.022964             -3       Obs               2,500
25%     3.022964             -3       Sum of wgt.       2,500

50%     6.424154                      Mean           7.558677
                        Largest       Std. dev.      5.947858
75%     11.20912       26.90506
90%     15.84712       26.90506       Variance       35.37702
95%     19.66824       27.90506       Skewness       .7807721
99%     23.92959       28.90506       Kurtosis       3.172237
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -3.864383   .2523952   -15.31   0.000    -4.359309   -3.369458
       exper |   .0280975   .0709969     0.40   0.692    -.1111214    .1673164
      exper2 |  -.0011247    .002422    -0.46   0.642    -.0058741    .0036248
        year |   .5143235   .0423054    12.16   0.000     .4313661    .5972809
       _cons |   5.574479   .4785969    11.65   0.000     4.635991    6.512966
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   234.42
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   234.42
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     234.42    0.0000 |      234.89   0.0000 |      234.42

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=214.72   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     234.42

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     82.02     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     82.18     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     79.57     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   309.80
                                                      Prob > F      =   0.0000
Total (centered) SS     =  897.6645365                Centered R2   =   0.7737
Total (uncentered) SS   =  138069.9225                Uncentered R2 =   0.9985
Residual SS             =  203.1744288                Root MSE      =    .2851

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0606661   .0033793    17.95   0.000     .0540429    .0672894
       exper |   .0070809    .003675     1.93   0.054    -.0001221    .0142838
      exper2 |  -.0000121   .0001253    -0.10   0.923    -.0002578    .0002335
        year |   .0198029   .0027686     7.15   0.000     .0143765    .0252292
       _cons |    6.74254   .0288493   233.72   0.000     6.685997    6.799084
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         214.718
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              234.422
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 246434256 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    2.46e+08           .   2.46e+08   2.46e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  246434256
                r(Var) =  .
                 r(sd) =  .
                r(min) =  246434256
                r(max) =  246434256
                r(sum) =  246434256


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 246434256



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(69 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.641372             -3
 5%    -.0697316             -3
10%     .9334003      -2.998901       Obs               2,500
25%     2.932511      -2.998901       Sum of wgt.       2,500

50%     5.766004                      Mean           6.959575
                        Largest       Std. dev.      5.645454
75%     10.28086       27.13623
90%     14.98126       27.13623       Variance       31.87115
95%     18.09657       27.13623       Skewness       .8551255
99%     23.22777       27.63215       Kurtosis       3.458792
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.472751   .2375504   -10.41   0.000    -2.938567   -2.006935
       exper |  -.1188511   .0671055    -1.77   0.077    -.2504393     .012737
      exper2 |   .0018694   .0023069     0.81   0.418    -.0026542     .006393
        year |   .5731405   .0408378    14.03   0.000      .493061    .6532199
       _cons |   5.674063   .4492581    12.63   0.000     4.793106     6.55502
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =   108.36
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =   108.36
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |     108.36    0.0000 |      108.57   0.0000 |      108.36

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=104.05   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     108.36

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     47.52     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     47.61     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     46.72     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   299.00
                                                      Prob > F      =   0.0000
Total (centered) SS     =  783.2535574                Centered R2   =   0.7802
Total (uncentered) SS   =  137273.3287                Uncentered R2 =   0.9987
Residual SS             =  172.1551696                Root MSE      =    .2624

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0658875   .0047328    13.92   0.000     .0566114    .0751636
       exper |   .0024836   .0033399     0.74   0.457    -.0040624    .0090297
      exper2 |  -.0000379   .0001138    -0.33   0.739    -.0002608    .0001851
        year |    .022179   .0033716     6.58   0.000     .0155707    .0287873
       _cons |   6.781877   .0318412   212.99   0.000     6.719469    6.844284
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):         104.053
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              108.355
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 197409968 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    1.97e+08           .   1.97e+08   1.97e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  197409968
                r(Var) =  .
                 r(sd) =  .
                r(min) =  197409968
                r(max) =  197409968
                r(sum) =  197409968


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 197409968



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(66 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.301959             -3
 5%    -.0115148             -3
10%      .942759             -3       Obs               2,500
25%     2.937965       -2.81025       Sum of wgt.       2,500

50%     5.935634                      Mean           6.965772
                        Largest       Std. dev.      5.423834
75%     10.23625       23.76536
90%     14.87288        24.0777       Variance       29.41798
95%     17.28995        25.0777       Skewness       .6943724
99%     21.76394        25.0777       Kurtosis       2.991366
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.145599    .231628    -9.26   0.000    -2.599802   -1.691396
       exper |  -.2309849   .0687829    -3.36   0.001    -.3658623   -.0961075
      exper2 |   .0072541   .0023537     3.08   0.002     .0026387    .0118694
        year |   .5312485   .0397102    13.38   0.000     .4533801    .6091168
       _cons |   6.114967   .4687682    13.04   0.000     5.195752    7.034182
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    85.81
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    85.81
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      85.81    0.0000 |       85.98   0.0000 |       85.81

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=83.12    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      85.81

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     18.10     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     18.13     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     18.00     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   168.58
                                                      Prob > F      =   0.0000
Total (centered) SS     =  793.9531653                Centered R2   =   0.6466
Total (uncentered) SS   =  137271.8742                Uncentered R2 =   0.9980
Residual SS             =  280.6106065                Root MSE      =     .335

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0480598   .0070551     6.81   0.000     .0342321    .0618875
       exper |  -.0017124   .0047585    -0.36   0.719     -.011039    .0076142
      exper2 |   .0001582   .0001614     0.98   0.327    -.0001582    .0004745
        year |   .0301183   .0045466     6.62   0.000     .0212071    .0390296
       _cons |   6.872567   .0492197   139.63   0.000     6.776098    6.969036
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          83.119
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               85.805
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 742041088 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    7.42e+08           .   7.42e+08   7.42e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  742041088
                r(Var) =  .
                 r(sd) =  .
                r(min) =  742041088
                r(max) =  742041088
                r(sum) =  742041088


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 742041088



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(55 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.841546             -3
 5%      .162038             -3
10%     1.023403             -3       Obs               2,500
25%            3             -3       Sum of wgt.       2,500

50%     6.230188                      Mean            7.48888
                        Largest       Std. dev.      5.829806
75%     11.04663       26.06721
90%       16.107       26.18018       Variance       33.98664
95%     19.07843        26.3115       Skewness       .8120267
99%     23.70769        26.3115       Kurtosis       3.145372
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.305447   .2693812    -8.56   0.000    -2.833681   -1.777213
       exper |   .0059403   .0716717     0.08   0.934    -.1346019    .1464825
      exper2 |   .0011472   .0024477     0.47   0.639    -.0036526     .005947
        year |   .4489907    .042921    10.46   0.000     .3648262    .5331552
       _cons |    5.14615   .4854185    10.60   0.000     4.194285    6.098014
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    73.24
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    73.24
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      73.24    0.0000 |       73.39   0.0000 |       73.24

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=71.30    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      73.24

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     15.04     P-val=0.0001
Anderson-Rubin Wald test           Chi-sq(1)=     15.07     P-val=0.0001
Stock-Wright LM S statistic        Chi-sq(1)=     14.98     P-val=0.0001

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   170.72
                                                      Prob > F      =   0.0000
Total (centered) SS     =  850.2383558                Centered R2   =   0.6558
Total (uncentered) SS   =  138607.9473                Uncentered R2 =   0.9979
Residual SS             =  292.6348206                Root MSE      =    .3421

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0451917   .0071763     6.30   0.000     .0311265    .0592569
       exper |   .0035664   .0044022     0.81   0.418    -.0050618    .0121947
      exper2 |   .0001793   .0001506     1.19   0.234    -.0001158    .0004745
        year |   .0250795   .0041596     6.03   0.000     .0169269    .0332322
       _cons |   6.852735   .0442981   154.70   0.000     6.765912    6.939558
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          71.298
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               73.245
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 681527104 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    6.82e+08           .   6.82e+08   6.82e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  681527104
                r(Var) =  .
                 r(sd) =  .
                r(min) =  681527104
                r(max) =  681527104
                r(sum) =  681527104


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 681527104



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(59 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -2.156283             -3
 5%     .0480556             -3
10%     1.053114      -2.986825       Obs               2,500
25%     3.316796      -2.986825       Sum of wgt.       2,500

50%     6.972861                      Mean           8.086916
                        Largest       Std. dev.      6.274554
75%     11.67665       27.44646
90%     17.29202       27.44646       Variance       39.37003
95%     20.59928       27.97842       Skewness       .7879991
99%      25.3756       27.97842       Kurtosis       3.185222
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |  -2.565362   .2823181    -9.09   0.000    -3.118963    -2.01176
       exper |   -.003498   .0809411    -0.04   0.966    -.1622167    .1552208
      exper2 |  -.0013672   .0027632    -0.49   0.621    -.0067856    .0040513
        year |   .5343892    .046653    11.45   0.000     .4429066    .6258718
       _cons |    6.10928    .546824    11.17   0.000     5.037005    7.181555
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    82.57
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    82.57
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      82.57    0.0000 |       82.74   0.0000 |       82.57

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=80.08    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      82.57

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     32.37     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     32.44     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     32.02     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   245.24
                                                      Prob > F      =   0.0000
Total (centered) SS     =  979.1675212                Centered R2   =   0.7949
Total (uncentered) SS   =  139944.0458                Uncentered R2 =   0.9986
Residual SS             =  200.8576827                Root MSE      =    .2834

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |    .062585   .0051908    12.06   0.000     .0524113    .0727588
       exper |   .0113463   .0038171     2.97   0.003     .0038649    .0188277
      exper2 |  -.0001261   .0001309    -0.96   0.335    -.0003826    .0001305
        year |   .0169684   .0035636     4.76   0.000     .0099839     .023953
       _cons |   6.726024   .0377592   178.13   0.000     6.652018    6.800031
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          80.085
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               82.570
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
Number of observations (_N) was 0, now 1.

     +-----------+
     |         a |
     |-----------|
  1. | 989709376 |
     +-----------+

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           a |          1    9.90e+08           .   9.90e+08   9.90e+08

scalars:
                  r(N) =  1
              r(sum_w) =  1
               r(mean) =  989709376
                r(Var) =  .
                 r(sd) =  .
                r(min) =  989709376
                r(max) =  989709376
                r(sum) =  989709376


/////////////////////////////////////////////////////////////////////////////




PARAMETERS:     SIZE: 2500 SEED: 989709376



/////////////////////////////////////////////////////////////////////////////

Number of observations (_N) was 1, now 2,500.

Panel variable: idtrab (unbalanced)
 Time variable: year, 1 to 11
         Delta: 1 unit
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(2252 real changes made)
(2,252 missing values generated)
(59 real changes made)
(2,252 real changes made)

                            educ
-------------------------------------------------------------
      Percentiles      Smallest
 1%    -1.905182             -3
 5%            0             -3
10%     .9347117      -2.949844       Obs               2,500
25%     2.662617      -2.949844       Sum of wgt.       2,500

50%     5.586627                      Mean           7.034847
                        Largest       Std. dev.      5.867178
75%     10.51909       26.90271
90%     15.98506       26.90271       Variance       34.42378
95%     18.65662       26.90271       Skewness       .8794748
99%     23.01184       27.90271       Kurtosis       3.189763
(2,252 missing values generated)
(2252 real changes made)

First-stage regressions
-----------------------


First-stage regression of educ:

Statistics consistent for homoskedasticity only
Number of obs =                   2500
------------------------------------------------------------------------------
        educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
          q1 |   -2.43116   .2615974    -9.29   0.000     -2.94413    -1.91819
       exper |  -.2004602   .0674378    -2.97   0.003       -.3327   -.0682203
      exper2 |   .0071831   .0023338     3.08   0.002     .0026067    .0117594
        year |   .5134182   .0425297    12.07   0.000     .4300211    .5968153
       _cons |   5.841163   .4430714    13.18   0.000     4.972337    6.709988
------------------------------------------------------------------------------
F test of excluded instruments:
  F(  1,  2495) =    86.37
  Prob > F      =   0.0000
Sanderson-Windmeijer multivariate F test of excluded instruments:
  F(  1,  2495) =    86.37
  Prob > F      =   0.0000



Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2495)  P-val | SW Chi-sq(  1) P-val | SW F(  1,  2495)
educ         |      86.37    0.0000 |       86.54   0.0000 |       86.37

Stock-Yogo weak ID F test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Sanderson-Windmeijer F statistic.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Anderson canon. corr. LM statistic       Chi-sq(1)=83.65    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      86.37

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2495)=     37.31     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     37.39     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     36.84     P-val=0.0000

Number of observations               N  =       2500
Number of regressors                 K  =          5
Number of endogenous regressors      K1 =          1
Number of instruments                L  =          5
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics consistent for homoskedasticity only

                                                      Number of obs =     2500
                                                      F(  4,  2495) =   276.83
                                                      Prob > F      =   0.0000
Total (centered) SS     =  853.4031481                Centered R2   =   0.7821
Total (uncentered) SS   =  136187.4139                Uncentered R2 =   0.9986
Residual SS             =  185.9673802                Root MSE      =    .2727

------------------------------------------------------------------------------
      lnwage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        educ |   .0655411   .0052648    12.45   0.000     .0552223    .0758599
       exper |   .0061573   .0035085     1.75   0.079    -.0007192    .0130338
      exper2 |  -.0000328   .0001218    -0.27   0.788    -.0002715     .000206
        year |   .0178931   .0034141     5.24   0.000     .0112016    .0245847
       _cons |   6.720862   .0357667   187.91   0.000      6.65076    6.790963
------------------------------------------------------------------------------
Underidentification test (Anderson canon. corr. LM statistic):          83.647
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               86.369
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
------------------------------------------------------------------------------
Sargan statistic (overidentification test of all instruments):           0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         educ
Included instruments: exper exper2 year
Excluded instruments: q1
------------------------------------------------------------------------------
r; t=3.49 20:17:34

. 
. clear
r; t=0.00 20:17:34

. 
. 
. // transform matrices in data/variables
. 
. 
. svmat mat_seed, n(mat_seed)
number of observations will be reset to 51
Press any key to continue, or Break to abort
Number of observations (_N) was 0, now 51.
r; t=0.00 20:17:34

. svmat mat_size, n(mat_size)
r; t=0.00 20:17:34

. svmat mat_beta_educ, n(mat_beta_educ)
r; t=0.00 20:17:34

. 
. format %16.0f mat_seed mat_size
r; t=0.00 20:17:34

. format %5.4f mat_beta_educ
r; t=0.00 20:17:34

. drop if mat_size == .
(1 observation deleted)
r; t=0.00 20:17:34

. sum

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   mat_seed1 |         50    4.94e+08    2.90e+08   1.24e+07   9.90e+08
   mat_size1 |         50        1750    757.6144       1000       2500
mat_beta_e~1 |         50    .0443732    .0397395  -.0879118   .0922195
r; t=0.00 20:17:34

. save data_beta_educ, replace
file data_beta_educ.dta saved
r; t=0.00 20:17:34

. 
. use data_beta_educ, clear
r; t=0.00 20:17:34

. 
. // graph the distribution of betas
. kdensity mat_beta_educ, xline(.06)
r; t=0.60 20:17:34

.         twoway kdensity mat_beta_educ1 if mat_size1 == `1',yaxis(1) legend(on label
> (1 "Sample Size: `1'"))/*
>         */ ytitle("Returns to E ducation") || kdensity mat_beta_educ1 if mat_size1 
> == `2', yaxis(2) legend(on label(2 "Sample Size: `2'")) /*
>         */ xline(.06) ytitle("Returns to E ducation",axis(2))
r; t=0.43 20:17:35

. 
.         graph export beta_educ1.png, replace
file
    /Users/miguelportela/Documents/GitHub/Stata_Training/3.Panel_Data/panel_simulat
    > ion/logs/beta_educ1.png saved as PNG format
r; t=0.17 20:17:35

. 
. elapse $st
Elapsed time was 5 seconds.
r; t=0.00 20:17:35

. 
. timer off 1
r; t=0.00 20:17:35

. timer list 1
   1:      4.70 /        1 =       4.6960
r; t=0.00 20:17:35

. 
. log close
      name:  <unnamed>
       log:  /Users/miguelportela/Documents/GitHub/Stata_Training/3.Panel_Data/panel_
> simulation/logs/panel_simulation_full.txt
  log type:  text
 closed on:  28 Dec 2021, 20:17:35
-------------------------------------------------------------------------------------
